{"Asset Coverage Ratio": "Asset coverage ratio measures the ability of a company to cover its debt obligations with its assets. The ratio tells how much of the assets of a company will be required to cover its outstanding debts. The asset coverage ratio gives a snapshot of the financial position of a company by measuring its tangible and monetary assets against its financial obligations. This ratio allows the investors to reasonably predict the future earnings of the company and to asses the risk of insolvency.", "Capitalization Ratio": "The capitalization ratio compares total debt to total capitalization (capital structure). The capitalization ratio reflects the extent to which a company is operating on its equity.", "Debt Ratio": "Debt ratio is a ratio that indicates proportion between company's debt and its total assets. It shows how much the company relies on debt to finance assets. The debt ratio gives users a quick measure of the amount of debt that the company has on its balance sheets compared to its assets. The higher the ratio, the greater risk will be associated with the firm's operation. A low debt ratio indicates conservative financing with an opportunity to borrow in the future at no significant risk.", "Debt Service Coverage Ratio (DSCR)": "The debt service coverage ratio (DSCR) has different interpretations in different fields. In corporate finance, for example, the debt-service coverage ratio can be explained as the amount of assessable cash flow to congregate the annual interest and principal payments on debt, not forgetting the sinking fund payments. ", "Debt-to-Equity Ratio": "The debt-to-equity ratio (debt/equity ratio, D/E) is a financial ratio indicating the relative proportion of entity's equity and debt used to finance an entity's assets.", "Debt-to-Income Ratio": "The debt-to-income ratio can be expressed as a personal finance measure that is helpful in comparing an individual’s debt payments to the income generated by him/her.", "Debt/EBITDA Ratio": "Debt/EBITDA is one of the common metrics used by the creditors and rating agencies for assessment of defaulting probability on an issued debt. In simple words, it is a method used to quantify and analyze the ability of a company to pay back its debts. This ratio facilitates the investor with the approximate time period required by a firm or business to pay off all debts, ignoring factors like interest, depreciation, taxes, and amortization.", "Equity Multiplier": "In finance, equity multiplier is defined as a measure of financial leverage. Akin to all debt management ratios, the equity multiplier is a method of evaluating a company’s ability to use its debt for financing its assets. The equity multiplier is also referred to as the leverage ratio or the financial leverage ratio.", "Equity Ratio": "The equity ratio refers to a financial ratio indicative of the relative proportion of equity applied to finance the assets of a company. This ratio equity ratio is a variant of the debt-to-equity-ratio and is also, sometimes, referred as net worth to total assets ratio.", "Financial Leverage": "Financial leverage can be aptly described as the extent to which a business or investor is using the borrowed money. Business companies with high leverage are considered to be at risk of bankruptcy if, in case, they are not able to repay the debts, it might lead to difficulties in getting new lenders in future. It is not that financial leverage is always bad. However, it can lead to an increased shareholders’ return on investment. Also, very often, there are tax advantages related with borrowing, also known as leverage.", "Fixed Assets to Net Worth": "Fixed assets to net worth is a ratio measuring the solvency of a company. This ratio indicates the extent to which the owners' cash is frozen in the form of fixed assets, such as property, plant, and equipment, and the extent to which funds are available for the company's operations (i.e. for working capital).", "Fixed Charge Coverage Ratio ": "Fixed charge coverage ratio is the ratio that indicates a firm’s ability to satisfy fixed financing expenses such as interest and leases. This means that the fixed charges that a firm is obligated to meet are met by the firm. This ratio is calculated by summing up Earnings before interest and Taxes or EBIT and Fixed charge which is divided by fixed charge before tax and interest.", "Interest Coverage Ratio (ICR)": "The interest coverage ratio (ICR) is a measure of a company's ability to meet its interest payments. Interest coverage ratio is equal to earnings before interest and taxes (EBIT) for a time period, often one year, divided by interest expenses for the same time period. The interest coverage ratio is a measure of the number of times a company could make the interest payments on its debt with its EBIT. It determines how easily a company can pay interest expenses on outstanding debt.", "Long Term Debt to Capitalization Ratio": "A Long Term Debt to Capitalization Ratio is the ratio that shows the financial leverage of the firm. This ratio is calculated by dividing the long term debt with the total capital available of a company. The total capital of the company includes the long term debt and the stock of the company. This ratio allows the investors to identify the amount of control utilized by a company and compare it to other companies to analyze the total risk experience of that particular company.", "Long Term Debt to Total Asset Ratio": "Long Term Debt to Total Asset Ratio is the ratio that represents the financial position of the company and the company’s ability to meet all its financial requirements. It shows the percentage of a company’s assets that are financed with loans and other financial obligations that last over a year. As this ratio is calculated yearly, decrease in the ratio would denote that the company is fairing well, and is less dependant on debts for their business needs.", "Non-current Assets to Net Worth": "Non-current assets to net worth ratio isa measure of the extent of a company's investment in low-liquid non-current assets. This ratio is important for comparison analysis because it is less dependent on industry (structure of company assets) than debt ratio or debt-to-equity ratio.", "Total Expense Ratio (TER)": "Total expense ratio (TER) is the ratio between total fund costs and total fund assets. It provides information regarding total costs involved annually for investment funds. The costs include expenses like legal fees, management fees, and other operational expenses. Total Expense Ratio is also called as Expense Ratio.", "Acid-Test Ratio": "The term “Acid-test ratio” is also known as quick ratio. The most basic definition of acid-test ratio is that, “it measures current (short term) liquidity and position of the company”. To do the analysis accountants weight current assets of the company against the current liabilities which result in the ratio that highlights the liquidity of the company.", "Cash Ratio": "Cash ratio (also called cash asset ratio) isthe ratio of a company's cash and cash equivalent assets to its current liabilities. Cash ratio is a refinement of quick ratio and indicates the extent to which readily available funds can pay off current liabilities. Potential creditors use this ratio as a measure of a company's liquidity and how easily it can service debt and cover short-term liabilities.", "Current Ratio": "", "Net Working Capital": "Net working capital (NWC) = current assets minus current liabilities.", "Quick Ratio": "The quick ratio is a measure of a company's ability to meet its short-term obligations using its most liquid assets (near cash or quick assets). Quick assets include those current assets that presumably can be quickly converted to cash at close to their book values. Quick ratio is viewed as a sign of a company's financial strength or weakness; it gives information about a company’s short term liquidity. The ratio tells creditors how much of the company's short term debt can be met by selling all the company's liquid assets at very short notice.", "Working Capital": "Working capital is the amount by which the value of a company's current assets exceeds its current liabilities. Also called net working capital. Sometimes the term \"working capital\" is used as synonym for \"current assets\" but more frequently as \"net working capital\", i.e. the amount of current assets that is in excess of current liabilities. Working capital is frequently used to measure a firm's ability to meet current obligations. It measures how much in liquid assets a company has available to build its business. ", "Working Capital Ratio (WCR)": "Working capital ratio is the alternative term for the term \"current ratio\".", "Cash Return on Capital Invested (CROCI)": "Cash return on capital invested (CROCI) is metric that compares the cash generated by a company to its equity. It is also sometimes known as “cash return on cash invested”. It compares the cash earned with the money invested.", "DuPont Formula": "DuPont formula (also known as the DuPont analysis, DuPont Model, DuPont equation or the DuPont method) is a method for assessing a company's return on equity (ROE) breaking its into three parts.", "Earnings Before Interest After Taxes (EBIAT)": "Earnings Before Interest and After Taxes is used to measure the ability of a firm to generate income through various operations during a specific course of time.", "Earnings Retention Ratio": "Earning Retention Ratio is also called as Plowback Ratio. As per definition, Earning Retention Ratio or Plowback Ratio is the ratio that measures the amount of earnings retained after dividends have been paid out to the shareholders. ", "EBIT (Earnings Before Interest and Taxes)": "EBIT (Earnings Before Interest and Taxes) is a measure of a entity's profitability that excludes interest and income tax expenses. ", "EBITDA": "EBITDA (Earnings Before Interest, Taxes, Depreciation and Amortization) is an indicator of a company's financial performance. It measures a company’s financial performance by computing earnings from core business operations, without including the effects of capital structure, tax rates and depreciation policies.", "EBITDARM": "Short for Earnings before Interest, Taxes, Depreciation, Amortization, Rent and Management fees, EBITDARM refers to a financial performance measure which is used in comparison to more common measures like EBITDA in situations where the rent and management fees of a company represent a larger-than-normal percentage of operating costs.", "EBT (Earnings Before Tax)": "Earnings before taxes (EBT) can be defined as the money retained by a company before deducting the money due to be paid as taxes. ", "Effective Rate of Return": "The effective rate of return is the rate of interest on an investment annually when compounding occurs more than once.", "Gross Profit Margin": "Gross profit margin (gross margin) is the ratio of gross profit (gross sales less cost of sales) to sales revenue. It is the percentage by which gross profits exceed production costs. Gross margins reveal how much a company earns taking into consideration the costs that it incurs for producing its products or services.", "Net Interest Margin": "The net Interest margin can be expressed as a performance metric that examines the success of a firm’s investment decisions as contrasted to its debt situations. A negative Net Interest Margin indicates that the firm was unable to make an optimal decision, as interest expenses were higher than the amount of returns produced by investments. Thus, in calculating the Net Interest Margin, financial stability is a constant concern.", "Net Profit Margin": "Net profit margin (or profit margin, net margin) is a ratio of profitability calculated as after-tax net income (net profits) divided by sales (revenue). Net profit margin is displayed as a percentage. It shows the amount of each sales dollar left over after all expenses have been paid.", "NOPLAT (Net Operating Profit Less Adjusted Taxes)": "NOPLAT is Net Operating Profit Less Adjusted Taxes. It is a measurement of profit which includes the costs and the tax benefits of debt financing. In other words, it can be said that NOPLAT is the earnings before interest and taxes after making the adjustments for taxes. It is a firm’s total operating profit where adjustments for taxes are made. It shows the profits that are generated from the core operations of a company after making the deductions of income taxes which are related to the company’s core operations. For the creation of DCF models or the discounted cash flow models, often NOPLAT is used.", "OIBDA": "\n", "Operating Expense Ratio": "Operating expense ratio can be explained as a way of quantifying the cost of operating a piece of property compared to the income brought in by that property. ", "Operating Margin": "Operating margin (operating income margin, return on sales) is the ratio of operating income divided by net sales (revenue).", "Overhead Ratio": "Overhead ratio is the comparison of operating expenses and the total income which is not related to the production of goods and service. The operating expenses of a company are the expenses incurred by the company on a daily basis. The operating expenses include maintenance of machinery, advertising expenses, depreciation of plant, furniture and various other expenses. These expenses when controlled can provide a company by maintaining the quality of the business. All companies want to minimise overhead expenses so that it helps them understand and manage the revenues of the company.", "Profit Analysis": "In managerial economics, profit analysis is a form of cost accounting used for elementary instruction and short run decisions. A profit analysis widens the use of info provided by breakeven analysis. An important part of profit analysis is the point where total revenues and total costs are equal. At this breakeven point, the company does not experience any income or any loss.", "Profitability Index": "", "Relative Return": "Relative return refers to the return achieved by an asset over a specific time period contrasted to a benchmark. The relative return is computed as the difference between the absolute return reached by the asset and the return reached by the benchmark.", "Return On Assets (ROA)": "Return on assets (ROA) is a financial ratio that shows the percentage of profit that a company earns in relation to its overall resources (total assets).Return on assets is a key profitability ratio which measures the amount of profit made by a company per dollar of its assets. It shows the company's ability to generate profits before leverage, rather than by using leverage.", "Return on Average Assets (ROAA)": "Return on Average Assets (ROAA) can be defined as an indicator used to evaluate the profitability of the assets of a firm. Putting it simple, this return on average assets indicates what a company can do with what it possesses. Generally, it is used by companies, banks and other financial institutions as an appraisal for determining their performance.", "Return on Average Capital Employed (ROACE)": "The return on average capital employed (ROACE) is a ratio that reveals the profitability against the investments made in the company. The ROACE is different from the return on capital employed for it counts the average of the opening and closing capital for the specific period contrasting to only the capital figure at the end of a period.", "Return on Average Equity (ROAE)": "The return on average equity (ROAE) refers to the performance of a company over a financial year. This ratio is an adjusted version of the return of equity that measures the profitability of a company. The return on average equity, therefore, involves the denominator being computed as the summation of the equity value at the beginning and the closing of a year, divided by two.", "Return On Capital Employed (ROCE)": "Return on capital employed (ROCE) is a measure of the returns that a business is achieving from the capital employed, usually expressed in percentage terms. Capital employed equals a company's Equity plus Non-current liabilities (or Total Assets − Current Liabilities), in other words all the long-term funds used by the company. ROCE indicates the efficiency and profitability of a company's capital investments.", "Return on Debt (ROD)": "The return on debt (ROD) can be expressed as the quantification of a company’s performance or net income as allied to the amount of debt issued by the company. Putting it other way, the return on debt refers to the amount of profit generated for every dollar held by a company in debt. ", "Return On Equity (ROE)": "Return on equity (ROE) is the amount of net income returned as a percentage of shareholders equity. It reveals how much profit a company earned in comparison to the total amount of shareholder equity found on the balance sheet.", "Return On Invested Capital (ROIC)": "ROIC is the capital which is return on investment in business is a high-tech way of examining a stock at return on investment that corrects for some specialties of Return on Assets and Return on Equity.", "Return on Investment (ROI)": "Return on investment (ROI) is performance measure used to evaluate the efficiency of investment. It compares the magnitude and timing of gains from investment directly to the magnitude and timing of investment costs. It is one of most commonly used approaches for evaluating the financial consequences of business investments, decisions, or actions.", "Return on Net Assets (RONA)": "The return on net assets (RONA) is a comparison of net income with the net assets. This is a metric of financial performance of a company that takes into account earnings of a company with regard to fixed assets and net working capital.", "Return on Research Capital (RORC)": "The return on research capital (RORC) is a calculation used to assess the revenue earned by a company as an outcome of expenditures made on research and development activities. The return on research capital is an element of productivity and growth, as research and development is one of the techniques employed by the companies to develop new products and services for sale. This metric is generally used in industries that depend largely on R&D like the pharmaceutical industry.", "Return on Retained Earnings (RORE)": "The return on retained earnings (RORE) is a calculation to reveal the extent to which the previous year profits were reinvested. The return on retained earnings is expressed as a percentage ratio. A higher return on retained earnings indicates that a company would be better off reinvesting the business. On the contrary, a lower return on retained earnings indicates that paying out dividends might prove to be in the company’s best interests.", "Return on Revenue (ROR)": "The return on revenue (ROR) is a measure of profitability that compares net income of a company to its revenue. This is a financial tool used to measure the profitability performance of a company. Also called net profit margin.", "Return On Sales (ROS)": "Return on sales (ROS) is a ratio widely used to evaluate an entity's operating performance. It is also known as \"operating profit margin\" or \"operating margin\". ROS indicates how much profit an entity makes after paying for variable costs of production such as wages, raw materials, etc. (but before interest and tax). It is the return achieved from standard operations and does not include unique or one off transactions. ROS is usually expressed as a percentage of sales (revenue).", "Revenue per Employee": "Revenue per employee measures the amount of sales generated by one employee. This is a measure of performance of human resources of a company. It is an indicator of productivity of company’s personnel. It also indicates how efficiently a company is utilizing its human resources.", "Risk-Adjusted Return": "It is a concept which measures the value of risk involved in an investment’s return. It is of great importance because it enables the investors to make comparison between performance of a high risk, high risk investment return with less risky and lower investment returns. Risk adjusted return can apply to investment funds, portfolio and to individual securities.", "Accounts Payable Turnover Ratio": "Accounts payable turnover ratio is an accounting liquidity metric that evaluates how fast a company pays off its creditors (suppliers). The ratio shows how many times in a given period (typically 1 year) a company pays its average accounts payable. An accounts payable turnover ratio measures the number of times a company pays its suppliers during a specific accounting period.", "Asset Turnover": "Asset turnover (total asset turnover) is a financial ratio that measures the efficiency of a company's use of its assets to product sales. It is a measure of how efficiently management is using the assets at its disposal to promote sales. The ratio helps to measure the productivity of a company's assets.", "Capacity Utilization Rate": "", "Cash Conversion Cycle (Operating Cycle)": "The cash conversion cycle (CCC) is the length of time between a firm's purchase of inventory and the receipt of cash from accounts receivable. It is the time required for a business to turn purchases into cash receipts from customers. CCC represents the number of days a firm's cash remains tied up within the operations of the business.", "Days Inventory Outstanding (DIO)": "\n", "Days Payable Outstanding (DPO)": "Days payable outstanding (DPO) is the accounts payableturnover expressed in days (accounts payable outstanding in days).", "Days Sales Outstanding (DIO)": "Days Sales Outstanding (DIO) is an average collection period in days for the accounts receivable (accounts payable outstanding in days).", "Defensive Interval Ratio (DIR)": "Defensive Interval Ratio is a ratio that measures the number of days a company can operate without having access to non-current assets. This ratio compares the assets to the liabilities instead of comparing assets to expenses. Defensive Interval Ratio or DIR is a good way to find out if the company is a good investment for you or not. Defensive Interval Ratio is also called as Defensive Interval Period.", "Fixed Asset Turnover": "Fixed asset turnover ratio compares the sales revenue a company to its fixed assets. This ratio tells us how effectively and efficiently a company is using its fixed assets to generate revenues. This ratio indicates the productivity of fixed assets in generating revenues. If a company has a high fixed asset turnover ratio, it shows that the company is efficient at managing its fixed assets. Fixed assets are important because they usually represent the largest component of total assets.", "Inventory Turnover": "Inventory turnover is a measure of the number of times inventory is sold or used in a given time period such as one year. It is a good indicator of inventory quality (whether the inventory is obsolete or not), efficient buying practices, and inventory management. This ratio is important because gross profit is earned each time inventory is turned over. Also called stock turnover.", "Receivable Turnover Ratio": "The receivable turnover ratio (debtors turnover ratio, accounts receivable turnover ratio) indicates the velocity of a company's debt collection, the number of times average receivables are turned over during a year. This ratio determines how quickly a company collects outstanding cash balances from its customers during an accounting period. It is an important indicator of a company's financial and operational performance and can be used to determine if a company is having difficulties collecting sales made on credit.", "Cash Flow Coverage Ratio": "The cash flow coverage ratio is an indicator of the ability of a company to pay interest and principal amounts when they become due. This ratio tells the number of times the financial obligations of a company are covered by its earnings. A ratio equal to one or more than one means that the company is in good financial health and it can meet its financial obligations through the cash generated by operating activities. A ratio of less than one is an indicator of bankruptcy of the company within two years if it fails to improve its financial position.", "Cash Flow Management": "Analyzing and managing the cash flows of a company is known as cash flow management. Cash flow on the other hand is an accounting statement. It shows the amount of cash a company has generated over a certain time period. Cash flow can be calculated monthly, semi – annually, quarterly and yearly. It helps a firm to analyses its financial strength.", "Cash Flow Return on Investment (CFROI)": "Cash flow return on investment (CFROI) is the indicator that helps a firm to evaluate the performance of an investment or product. It can also be termed as the calculation that helps the stock market to set prices on the basis of cash flow.", "Free Cash Flows / Operating Cash Flows Ratio": "This ratio compares the free cash flows (FCF) to the operating cash flows (OCF). The more free cash flows are embedded in the operating cash flows of a company, the better it is. Higher free cash flows to operating cash flows ratio is a very good indicator of financial health of a company.", "Operating Cash flow / Sales Ratio": "This ratio compares the operating cash flows a company to its sales revenue. This ratio gives the analysts and investors indications about the ability of a company to generate cash from its sales. In other words, it shows the ability of a company to turn its sales into cash. It is expressed as a percentage.", "Price/Cash Flow Ratio": "Price/cash flow ratio is an investment valuation ratio used by investors to evaluate the attractiveness of investing in a company’s shares. This ratio considers cash flows only and removes the effect of non cash items like depreciation. It is calculated by dividing market value of a company’s share to operating cash flow that company generates per share.", "Business Valuation": "Business valuation can be explained as a process and set of procedures used for estimation of economic value of an owner’s business interests. Valuation is used by the participants of financial markets for determination of prices which can be paid or received willingly to consummate a business sale.", "Dividend Payout Ratio": "Dividend payout ratio compares the dividends paid by a company to its earnings. ", "Dividend Policy Ratios": "Dividend policy ratios measure how much a company pays out in dividends relative to its earnings and market value of its shares. These ratios provide insights into the dividend policy of a company. They compare the dividends to the earnings to measure how much of its earnings a company is paying out in dividends. They also compare the dividends to share prices to see how much cash flow the investors get for their investments in the company’s shares.", "Dividend Yield": "Dividend yield is the amount that a company pays to its share holders annually for their investments. It is expressed as a percentage and indicates attractiveness of investing in a company’s stocks.", "Enterprise Value (EV)": "The enterprise value (EV) measures the value of the ongoing operations of a company. It attempts to measure the value of a company's business instead of measuring the value of the company. It is the measure for calculating how much it would cost to buy a company’s business free of its debts and liabilities. It can be thought of as a theoretical takeover price of a company’s business.", "Enterprise Value Multiple": "Enterprise value multiple is the comparison of enterprise value and earnings before interest, taxes, depreciation and amortization. This is a very commonly used metric for estimating the business valuations. It compares the value of a company, inclusive of debt and other liabilities, to the actual cash earnings exclusive of the non-cash expenses.", "EV/EBITDA ratio": "The EV/EBITDA ratio is a comparison of enterprise value and earnings before interest, taxes, depreciation and amortization. This is a very commonly used metric for estimating the business valuations. It compares the value of a company, inclusive of debt and other liabilities, to the actual cash earnings exclusive of the non-cash expenses.", "Gordon Growth Model": "Gordon Growth Model is a model to determine the fundamental value of stock, based on the future sequence of dividends that mature at a constant rate, provided that the dividend per share is payable in a year, the assumption of the growth of dividend at a constant rate is eternity, the model helps in solving the present value of the infinite series of all future dividends. Since the assumption is based on the constant growth rate of dividends, this formula would be applicable mostly to well established and mature companies. This model was developed by Professor Myron Gordon, hence called Gordon Growth Model.", "Loan-to-Value Ratio (LTV)": "An examination before approving a mortgage by the financial institution is known as loan-to-value ratio. It can also be known as the risk assessment that is made before a mortgage is accepted.", "Net Asset Value per Share (NAVPS)": "The net asset value per share can be defined as an expression for net asset value that indicates the value per share for a fund (exchange-traded, mutual, and closed-end) or a company.", "PEG ratio": "The PEG ratio which is the price/earnings to growth ratio is used to determine the relative trade-off between price of stock, earnings per share (EPS) and the expected growth of the company.", "Price to Earnings Ratio (P/E Ratio)": "The price to earnings ratio (P/E ratio) is the ratio of market price per share to earning per share. The P/E ratio is a valuation ratio of a company's current price per share compared to its earnings per share. It is also sometimes known as “earnings multiple” or “price multiple”.", "Price-to-Research Ratio": "The Price-to-research ratio can be expressed as a measure of the relationship between a company’s market capitalization and expenses on the research and development. Putting it other way, it can be referred as a comparison between how much is spent by a company on research and development and the value of its current share price. A low price-to-research ratio is considered to be financially sound, indicating that the company is invested heavily in R&D and is, therefore, most likely capable of producing future profitability.", "Price/Book Value Ratio": "Price/book value ratio is an investment valuation ratio used by investors or finance providers to compare market value of a company’s shares to its book value (Shareholder Equity). This ratio indicates how much shareholders are contributing/paying for a company’s net assets.", "Price/Sales Ratio": "Price to sales ratio compares the price of a share to the revenue per share. This ratio is usually used for valuation of shares. It takes into account the past performance of a company for valuation of its shares.", "Stock Price": "A Stock Price indicates the cost per share of the target company. It also helps in ascertaining the changes of value of the public company in the economy. In every country’s economy, finance plays an important role in the stock market. Being one of the most complicated matter, it should be handled with great care to understand the stock price and stock market and also read the up’s and down’s of the market in order to invest in a certain business.", "AAA Rating": "", "Adjusted Present Value (APV)": "The Adjusted Present Value (APV) can be delineated as the Net Present Value of a project, financed exclusively by equity, added to the Present Value (PV) of any financing benefits (the added effects of debt). ", "Altman Z-Score": "The Altman Z-Score is an analytical representation created by Edward Altman in the 1960s which involves a combination of five distinctive financial ratios used for determining the odds of bankruptcy amongst companies. Most commonly, a lower score reflects higher odds of bankruptcy.", "Annual Equivalent Rate (AER)": "Annual Equivalent Rate or AER is the rate of interest an investor gets for a fixed deposit for a year on a yearly basis. By definition, Annual Equivalent Rate or AER is a figure which shows what the interest rate on an account would be if interest was paid for a full year and compounded. The interest is calculated to determine the returns that a person can get by adding the interest payment to the amount originally deposited and the next interest payment will be established on the marginally higher account balance.", "Annualized Rate": "Annualized rate is a rate of return for a given period that is less than 1 year, but it is computed as if the rate were for a full year. It is essentially an estimated rate of annual return that is extrapolated mathematically. The annualized rate is calculated by multiplying the change in rate of return in one month by 12 (or one quarter by four) to get the rate for the year. Annualized rate of return is computed on a time-weighted basis.", "Annuity": "In finance theory, the term annuity is used to refer to a terminating stream of fixed payments over a particular time period. Most commonly, this usage is reflected in financial discussions, generally in connection with the valuation of the payments’ stream, also considering the time value of money concepts like interest rates and future value. The annuities can be exemplified as regular deposits to a savings account, monthly insurance payments, and monthly home mortgage payments.", "Average Annual Growth Rate": "Average annual growth rate refers to the average increase in an individual’s portfolio or investment value over a year’s period. The average annual growth rate can be evaluated for any kind of investment, but does not include any measure of the overall risk involved in the investment, as calculated by the volatility of its price.", "Average Annual Return": "The average annual return is defined as a percentage figure which is used while reporting the previous returns, like 3-, 5-, and 10-year average returns of a mutual fund. The average annual return is calculated net of a fund’s operating expense ratio.", "Bad Debt": "A bad debt can be defined and explained as an amount which has been written off by the business as a loss and categorized as an expense for the debt owed to the business cannot be collected and all efforts made for the same have failed to collect the owed amount. ", "Balance Sheet Analysis": "Balance sheet analysis can be defined as an analysis of the assets, liabilities, and equity of a company. This analysis is conducted generally at set intervals of time, like annually or quarterly. The process of balance sheet analysis is used for deriving actual figures about the revenue, assets, and liabilities of the company.", "Bankruptcy": "Bankruptcy can be explained as a legal proceeding which involves a business or individual being unable to repay his outstanding debts. ", "Book Value of Equity per Share (BVPS)": "The book value of equity per share is a financial measure which indicates a per share estimation of the minimum value of an entity’s equity. Although the book value of equity per share is a factor that can be used by the investors to determine the value of stock, it presents only a limited value of the firm’s situation. In simple words, book value per equity share gives a snap shot of a firm’s present situation not including the future considerations of a firm.", "Break-even Point": "The break-even point is a point where total costs (expenses) and total sales (revenue) are equal.", "Budgeting": "", "Capital Asset Pricing Model (CAPM)": "The Capital Asset Pricing Model (CAPM) refers to a model that delineates the relationship between risk and expected return and what is used in the pricing of risky securities. ", "Capital Budgeting": "Capital budgeting refers to a process that involves a business to determine whether the projects, like investing in a long-term venture or building a new plant, are worth following. Many times, an eventual project’s lifetime cash inflows and outflows are evaluated so as to determine whether the generated returns congregate to a satisfactory target benchmark. Capital budgeting is also referred as “investment appraisal”.", "Capital Employed": "Generally, capital employed is presented as deducting the current liabilities from the total assets. It can be defined as equity plus loans which are subject to interest. To define it properly, capital employed can be expressed as the total amount of capital that has been utilized for acquisition of profits. It also refers to the value of all assets (fixed as well as working capital) employed in a business.", "Capital Output Ratio": "\n", "Cash Burn Rate": "The rate at which a company utilizes its cash supply over a specific period of time is known as the cash burn rate. From its name, it is clear that it is used to measure the speed at which cash ends or is burnt in consumption. It is specially used in such situations where the cash flow of the business activities is negative rather than positive. It is meant for such businesses that have been started newly and because of this they have not managed to make much of the sales that could cover up the expenses.", "Coefficient of Variation": "The coefficient of variation (CV) refers to a statistical measure of the distribution of data points in a data series around the mean. It represents the ratio of the standard deviation to the mean. The coefficient of variation is a helpful statistic in comparing the degree of variation from one data series to the other, although the means are considerably different from each other.", "Company Analysis": "Company analysis is a process carried out by investors to evaluate securities, collecting info related to the company’s profile, products and services as well as profitability. It is also referred as ‘fundamental analysis.’ A company analysis incorporates basic info about the company, like the mission statement and apparition and the goals and values. During the process of company analysis, an investor also considers the company’s history, focusing on events which have contributed in shaping the company.", "Compound Annual Growth Rate": "The compound annual growth rate (CAGR) of a company refers to the growth rate of an investment, year after year, for a particular time period.", "Compound Interest": "Compound interest is the form of simple interest where interest is added to the principle. When this happens, the interest that is added to the principle also earns interest. This method of addition of interest to the principle is known as compounding.", "Contribution Margin": "Contribution Margin (CM) is the difference between sales revenue and variable costs. It is the measure of the profit margin that focuses on the proportion of sales revenue which is left after the deduction of variable costs associated with the product.", "Cost of Debt": "Cost of debt generally refers to the effective paid by a company on its debts. The cost of debt can be calculated in either before or after tax returns. However, the interest expense being deductible, the after tax cost is considered very often. Moreover, the cost of debt is one part of capital structure of the company and also includes the cost of equity.", "Country Risk": "Country risk is a collection of risks that are associated with investing in a foreign country instead of investing in the domestic market. The risks included are exchange rate risk, economic risk, political risk, and sovereign risk or transfer risk and by which there is a risk of capital being frozen for Government action. Each country has different type of country risk, some having higher risks would not encourage any type of foreign investments.", "Credit Risk": "Credit risk refers to the risk of loss of principal or loss of a pecuniary reward stemming from a borrower’s failure in repaying a loan or else wise meet a contractual debt. Credit risk arises every time a borrower is looking ahead to use future cash flows through the payment of a current obligation. The investors are rewarded for presuming credit risk through the way of interest payments from the issuer or borrower of a debt contract.", "Credit Score": "A credit score refers to a statistically derived numeric expression which implicates the creditworthiness of a person. This credit score, as an indicator of the creditworthiness, is used by the lenders to access the chances of a person repaying his/her debts.", "Currency Risk": "Currency risk refers to a risk form arising from the changes price of one currency as compared to another currency. Whenever companies or investors possess assets or business operations across national boundaries, they experience currency risk if their positions are not prevaricated. Currency risk is also referred as exchange rate risk. Putting it simple, currency risk can be defined as the possibility that currency depreciation will show negative effect on the value of assets, investments, and their related interest and dividend payment streams, specifically those securities denominated in foreign currency.", "Data Analysis Techniques for Fraud Detection": "Data analysis techniques for fraud detection refer to the techniques that make use of statistical techniques and artificial intelligence to detect fraud in any company. Fraud is defined as an intentional act of an individual or more persons to deny another person or organization of something that is of value for their own gain. Every year, the number of fraud cases is increasing and the reason for this may be attributed to technological development.", "Deferred Payment Annuity": "An annuity is essentially a finance related contract, which permits the person who is buying it to pay on a lump-sum basis or make payments in series, in return for acquiring disbursements at regular intervals in future. Deferred Payment Annuity is a type of an annuity in which the payments that are received start somewhere in the future instead of starting at the time it is initiated.", "Degree of Combined Leverage (DCL)": "The Degree of Combined Leverage (DCL) is the leverage ratio that sums up the combined effect of the Degree of Operating Leverage (DOL) and the Degree of Financial Leverage (DFL) has on the Earning per share or EPS given a particular change in shares. This ratio helps in ascertaining the best possible financial and operational leverage that is to be used in any firm or business.", "Degree of Financial Leverage (DFL)": "The degree of financial leverage (DFL) is the leverage ratio that sums up the effect of an amount of financial leverage on the earning per share of a company. The degree of financial leverage or DFL makes use of fixed cost to provide finance to the firm and also includes the expenses before interest and taxes. If the Degree of Financial Leverage is high, the Earnings Per Share or EPS would be more unpredictable while all other factors would remain the same.", "Degree of Operating Leverage (DOL)": "The Degree of Operating Leverage (DOL) is the leverage ratio that sums up the effect of an amount of operating leverage on the company’s earnings before interests and taxes (EBIT). Operating Leverage takes into account the proportion of fixed costs to variable costs in the operations of a business. If the degree of operating leverage is high, it means that the earnings before interest and taxes would be unpredictable for the company, even if all the other factors remain the same.", "Discount Rate": "In finance, the discount rate has different meanings, some important ones mentioned below...", "Discounted Cash Flow": "The discounted cash flow is a quantification method used to evaluate the attractiveness of an investment opportunity. The Discounted Cash Flow analysis involves the use of future free cash flow protrusions and discounts them so as to reach the present value, which is then used to calculate the potential for investment. ", "Discounted dividend model (DDM)": "The discounted dividend model (DDM) is a procedure for valuing a stock’s price by using expected dividends and discounting them back to present value. The underlying idea is that if the value obtained from the dividend discount model is greater than the value at which shares are being already traded, the stock is considered to be undervalued. Putting it simple, the discounted dividend model is one of the methods of evaluating a company based on the theory that a stock holds the value equal to the discounted sum of all the prospective dividend payments.", "Diversification": "Diversification strategies are made use of to expand the operations of the firm by adding different strategies to a business. The main aim of diversification in a company is to allow the company to establish itself apart from its current operations. There are two types of diversification strategies. Concentric diversification is when a new venture is strategically related to the existing lines of business, and Conglomerate diversification is when there is nothing common between old and new business strategies, that is both the businesses are not related in anyway.", "Due Diligence": "The term “due diligence” is, generally used for various concepts involving investigation of either a person or business before signing a contract, or an act involving certain standards of care.", "Economic Order Quantity Model (EOQ)": "As the name suggests, Economic order quantity (EOQ) model is the method that provides the company with an order quantity. This order quantity figure is where the record holding costs and ordering costs are minimized. By using this model, the companies can minimize the costs associated with the ordering and inventory holding. In 1913, Ford W. Harris developed this formula whereas R. H. Wilson is given credit for the application and in-depth analysis on this model.", "Economic Risk": "Generally speaking, economic risk can be described as the likelihood that an investment will be affected by macroeconomic conditions such as government regulation, exchange rates, or political stability, most commonly one in a foreign country. In other words, while financing a project, the risk that the output of the project will not produce adequate revenues for covering operating costs and repaying the debt obligations.", "Economic Value Added (EVA)": "", "Elasticity of Demand": "Elasticity of demand refers to the degree of responsiveness to change in the demand of a product or services and its price.", "Explicit Cost": "Explicit cost is defined as the direct payment which is supposed to be made to others during the due course of running business. This includes the wages, rents or materials which are due in the contract.", "Factor Analysis": "Factor analysis is to reduce a set of variables to a set of new variables. It can be done through many methods and the variables are reduced to a set of lesser variables. In other words the process of making a reduced set of new and useful variables from a set of many variables is factor analysis", "Financial Analysis Report": "Comprehensive financial analysis reports accentuate the strengths and weaknesses of a company. Communicating the company’s strengths and weaknesses in an accurate and honest manner is helpful in convincing the investors to invest in your business. A financial analysis report is, basically, a document that attracts high interest of investors as it contains a detailed appraisal of a company’s financial health.", "Financial Forecast": "", "Financial Modeling": "Financial modeling refers to the process through which a company builds up a financial representation of some, or even all aspects of the company or the given security. The financial model is generally featured by performing calculations, and making recommendations on the basis of that information. Moreover, the model might also précis specific events for the end user in addition to providing direction regarding possible alternatives or actions.", "Financial Planning": "Financial planning can be delineated as long-term profit planning intended at generating higher return on assets, growth in market share, and at solving foreseeable problems. Putting it simple, it is the process of estimating the amount of required capital and determining its competition. It is a process that frames financial policies in relation to investment, procurement, and administration of an enterprise’s funds.", "Financial Ratio": "A financial ratio can be well defined as a comparative magnitude of two selected statistical values taken from the financial statements of a business enterprise.", "Financial Responsibility": "Financial responsibility refers to the process of managing money and other similar assets in a way that is considered productive and is also in the best interest of the individual, or the family, or the business company. Being adept at financial tasks and money management involves cultivation of a mindset which makes it possible to look beyond the needs of the present so as to provide for the needs of future. Besides, it is essentially important to understand the various basic principles so as to achieve a high level of financial responsibility.", "Financial Statement Analysis": "Financial statement analysis can be referred as a process of understanding the risk and profitability of a company by analyzing reported financial info, especially annual and quarterly reports. Putting another way, financial statement analysis is a study about accounting ratios among various items included in the balance sheet. These ratios include asset utilization ratios, profitability ratios, leverage ratios, liquidity ratios, and valuation ratios. Moreover, financial statement analysis is a quantifying method for determining the past, current, and prospective performance of a company.", "Fixed Costs": "Fixed costs, in economics, are explained as business expenses which do not depend on the level of goods and services proffered by a business. ", "Fundamental Analysis": "Fundamental analysis can be explained as a method of estimating a security which involves attempting to evaluate its basic value by assessing allied financial, economic, and other quantitative and qualitative factors. Fundamental analysis aims at studying everything which affects the value of the security, including macro-economic factors (such as the overall economy and industry conditions) and company-specific factors (including financial condition and management).", "Future Value": "The future value (FV) refers to the value of an asset or cash at a particular date in the future which is equivalent to the value of a specified sum at present. The future value can also be explained as the amount of money which will be reached by a present investment as a result of its growth in the future. ", "Gearing Ratio": "Quite closely related to solvency ratio, gearing ratio is a general term recounting a financial ratio comparing some form of owner’s capital (equity) to borrowed funds. Moreover, gearing is a quantification of financial leverage, indicative of the extent to which a firm’s activities are financed by owner’s finances vs. creditor’s finances. Putting another way, gearing ratio is used mainly for analyzing a company’s capital structure and thus assessing the company’s financial position in the long run.", "Horizontal Analysis of Financial Statements": "Horizontal analysis of financial statements involves comparison of a financial ratio, a benchmark, or a line item over a number of accounting periods. This method of analysis is also known as trend analysis. Horizontal analysis allows the assessment of relative changes in different items over time. ", "Idiosyncratic Risk": "The idiosyncratic risk can be defined as the risk which affects a very diminutive number of assets, and can be almost eradicated through diversification. It is quite similar to unsystematic risk.", "Implicit Costs": "Implicit cost in economics, means the opportunity cost that is equal to what that has to be given up by a firm for using factors that it neither hires nor purchases. Implicit cost is actually the cost that is the consequence of using the assets, instead of lending, selling or renting them. It also means the income that is forgone from making a choice of not to work. Implicit cost is also known as implied cost, notional cost or imputed cost.", "Industry Analysis": "Industry analysis can be delineated as a market assessment tool which is designed to provide a business with ideas of complexity in a specific industry. Putting it simple, the industry analysis is a report that guides companies on their business strategy. ", "Industry Benchmark": "A benchmark, basically, refers to a standard used to measure the performance of a mutual fund, security, or investment manager. Generally speaking, broad market and market-segment stock and bond indexes are used for this objective. As explained by Investopedia, while evaluating the performance of any investment, it is essential to compare it with an apt benchmark. In the financial field, there are numerous indexes used by analysts to determine the performance of a particular investment.", "Internal Rate of Return (IRR)": "The internal rate of return (IRR) is defined as the return rate that makes the present value of cash flows in addition to the final market value of any investment thus bringing it to the level of current market price of the same. Used frequently in determining the worth of an investment, the internal rate of return is an important calculation. ", "Investment Analysis": "The study to analyze the performance of a particular investment for a given investor is known as investment analysis. It is also known as the study of the past decisions made for a particular investment made.", "Investment Banking": "Investment banking can be explained as a form of banking which provides funds to meet the capital requirements of companies. Moreover, investment banking supports as it carries out IPOs, bond offerings, and private placement in addition to acting as a broker and helping out in accomplishment of mergers and possessions. Putting it other way, investment banking is a field of banking that helps businesses in acquiring funds. Also, besides acquiring fresh working capital, investment banking also proffers advice for wide ranging transactions a business might engage in.", "Investment Management": "Investment management refers to the professional management of different securities and assets so as to meet specified investment goals for the investors’ benefits. Investors may include private investors as well as institutions. Investment management is, moreover, a huge and essential global industry in its own right accountable for caretaking of trillions of dollars, yuans, pounds, euro, and yen.", "Jarrow Turnbull Model": "Jarrow Turnbull Model is the first models for pricing credit risk. It was developed by two people, Robert Jarrow and Stuart Turnbull. This model makes use of multiple factor and complete analysis of interest rates to calculate the probability of default. It is one of the best reduced-forms of model that helps in ascertaining credit risk. The other type of model to ascertain credit risk is structural model.", "Key Performance Indicators (KPI)": "The KPI can be expressed as a set of irrefutable measures used by an industry or a company to estimate or determine performance in terms of congregating their strategic as well as operational goals. The KPIs differ between companies and industries, depending upon the performance criteria or the priorities. KPI is also, sometimes, referred as ‘Key Success Indicators (KSI).’", "Labor Efficiency Variance": "In order to understand the labor efficiency variance properly, you will have to understand the concept and workings of standard costing first. Variance is simply a method that is used in the bigger picture of the standard costing.", "Leverage Ratios": "Leverage ratios are financial ratios that measure a company's level of debt in relation to its equity or assets.", "Leveraged Buyout": "A leveraged buyout (LBO) refers to the possession of a company which is funded mostly with debt obligations. Industries and companies of all sizes have been aimed by leveraged buyout transactions. Generally, leveraged buyout involves the use of a combination of different debt instruments from banks and debt capital markets.", "Liquid Asset": "Liquid assets can be referred as an asset that can be converted into cash quickly and with minimal impact to the price received. Generally, liquid assets are considered similar to cash for their prices being relatively stable on being sold in the open market. As per Investopedia, to be a liquid asset, it is essential for the asset to have an established market with sufficient participants to absorb the selling without significantly i8nfluencing the price of the asset.", "Marginal Analysis": "Marginal analysis refers to an evaluation of the additional benefits of an activity contrasted to the additional costs of that activity. Marginal analysis is used by companies as a decision making tool to provide help in increasing the profits. Moreover, marginal analysis is used instinctively to make a host of everyday decisions. Also, marginal analysis is generally used in microeconomics while analyzing the complexity of a system being affected by marginal manipulation of its comprising variables.", "Marginal Revenue": "Marginal revenue refers to the increase in revenue resulting from the sale of one extra unit of output. Many of the competitive firms continue to produce output until marginal revenue equals marginal cost. However, although marginal revenue can remain constant over a particular level of output quantity, it follows the law of diminishing returns and eventually slows down, with an increase in the output level.", "Market Capitalization": "Market capitalization can be delineated as the total dollar market value of all the outstanding shares of a company. This figure is used by the investment community to determine the size of a company as contrasted to sales or total assets figures. Market capitalization is also generally referred as “market cap.”", "Market Risk": "Market risk also known by some as systematic risk is when there is potential for an investor to lose the value of its factors or experience a decline in them due to the volatility of the market that is for example by the structural changes that occur in the market or the economy as whole.", "Market Risk Premium": "Market risk premium is the variance between the predictable return on a market portfolio and the risk-free rate. Market Risk Premium is equivalent to the incline of the security market line (SML), a capital asset pricing model.", "Microeconomic Pricing Model": "The Microeconomic Pricing Model is essentially a model wherein prices for a concerned good or service are determined within a given market. As per this model, the prices are determined based on the balance of demand and supply in a market.", "Mixed Expenses (Semi-variable Expenses)": "Overheads that are fixed in the total volume of activity but variable when calculated as per unit are called fixed overheads.", "Monte Carlo Simulation": "Monte Carlo Simulation implies a problem solving technique which is used to estimate the possibility of certain outcomes by running several trial runs, known as simulations, through the use of random variables. ", "Most Important Financial Ratios": "The most cost commonly and top five ratios used in the financial field include...", "Moving Average": "Moving Average is basically an indicator that is required for the purpose of conducting a technical analysis that further displays the security’s price average value over a definite period. Moving Average is often utilized for measuring momentum and also for defining areas of resistance and support. Moving averages are utilized for emphasizing a trend’s direction and for smoothing out volume and price fluctuations, which can result in misinterpretation.", "Negative Equity": "Negative equity is basically the name of a phenomenon. This is found to be observed the values of an asset change during different situations. For example, at the time of securing a loan, this value is less while the outstanding balance in the amount of loan is higher than its value.", "Net Debt": "Net debt can be expressed as a metric that indicates the overall debt situation of a company by netting the value of the liabilities and debts of a company along with its cash and other similar liquid assets. To put it simple, net debt refers to the total debt of a company minus cash on hand. As expressed by Investopedia, one of the most important factors that require consideration while investing in a company is the amount of debt carried by the company.", "Net Present Value": "As explained by financial authors, the Net Present Value or Net Present Worth is defined as the present values of the individual cash flows, both incoming and outgoing, of a business entity.", "Net Present Value of Growth": "In order for a company to calculate what the new addition or expansion project will add to the worth of the existing firm, it needs to calculate thepresent value of growth opportunities. Furthermore, an appropriate purchase price can be calculated by utilizing the present value model. The net present value of growth opportunities can be determined by deducting purchase price from the present value of growth opportunities.", "Non-diversifiable Risk": "Non-diversifiable risk can be referred to a risk which is common to a whole class of assets or liabilities. The investment value might decline over a specific period of time only due to economic changes or other events which affect large sections of the market. However, diversification and asset allocation can provide protection against non-diversifiable risk as different sections of the market have a tendency to underperform at different times. Non-diversifiable risk can also be referred as market risk or systematic risk.", "Non-systematic Risk": "Also referred as “specific risk”, “residual risk” or “specific risk”, non-systematic risk is the industry or company specific risk which is inherent in every investment. Putting it simple, unlike systematic risk affecting the entire market, it applies only to certain investments. Moreover, it is the element of price risk which can be eliminated largely through adequate diversification within a specific asset class. It is, therefore, the individual business risk related to underlying stock, if the company goes bankrupt, it can be stated as a non-systematic risk event and usually has little to do with the general recede and flow of the entire market.", "Normal Deviate (Standardized Value)": "The division of distance of one data point from its mean to the standard deviation of the distribution is known as normal deviate or the standardized value. A unit deviation with zero mean is standard normal deviation and it shows the variation from the average mean or the expected value.", "Opportunity Cost": "Opportunity cost can be defined as the cost of an alternative which must be abstained from so as to pursue a specific action. In other words, opportunity cost refers to the benefits that could have been received through an alternative action.", "Optimal Capital Structure": "The optimal capital structure indicates the best debt-to-equity ratio for a firm that maximizes its value. Putting it simple, the optimal capital structure for a company is the one which proffers a balance between the idyllic debt-to-equity ranges thus minimizing the firm’s cost of capital. Theoretically, debt financing usually proffers the lowest cost of capital because of its tax deductibility. However, it is seldom the optimal structure for as debt increases, it increases the company’s risk.", "Pareto Principle (80–20 Rule)": "Pareto principle which is also known as the 80 to 20 rule was created by Vilfredo Pareto who was an Italian economist in the year 1906. This formula was created to explain the unequal distribution of wealth assuming that 20 percent of the people of the country hold 80 percent of the total wealth. At the end of the year 1940, DR. Joseph M. Juran attributed this rule to Pareto calling it the Pareto Principle.", "Passive Management": "Passive management refers to a style of management related to mutual and exchange traded funds wherein a fund’s portfolio reflects the market index. Passive management is the converse of active management which includes attempt by a fund’s manager to beat the market with different investing strategies and selling/buying decisions of securities of a portfolio. Passive management is also referred as ‘passive strategy’, ‘index investing’, and ‘passive investing.’", "Payback Period": "In simple terms, payback period can be defined as a tool of capital budgeting which calculates the length of time required to recover the original invested amount. This period is usually expressed in years and can be calculated using simple dividing total investment on a project and annual cash inflow.", "Performance Indicator": "A performance indicator refers to an industry jargon term for a type of performance measure. The performance indicators are, generally, used by an organization for evaluating its achievements or the achievements of a specific activity it is engaged in. Many a times, success is defined in terms of progressing towards strategic goals, but very often, success is simply referred as the repeated achievement of some level of operational goals.", "Perpetuity": "Perpetuity can be well defined as an annuity without any end, or it can be said that perpetuity features a stream of cash payments continuing forever. To describe in detail, perpetuity is an annuity wherein the periodic payments commence on a specific date and continue to an indefinite time. ", "Present Value": "The Present Value of an entity can be defined as the present worth of a prospective amount of money or a stream of cash flows with a specified return rate. The Present Value is conversely related to the discount rate. ", "Price Sensitivity": "Price sensitivity is also known as price elasticity of demand and this means the extent to which sale of a particular product or service is affected. Another way of explaining price sensitivity is, “the consumer demand for a product is changed by the cost of the product. It basically helps the manufacturers study the consumer behavior and assists them in making good decisions about the products.", "Production Possibility Frontier": "\n", "Qualitative Analysis": "A qualitative analysis is a technique which uses complex mathematical and statistical modeling, measurement and research to evaluate things. There could be a number of reasons behind conducting this analysis and may include: measurement of progress; performance evaluation; prediction of related global events and valuation of financial instrument. For a business individual or company it is very important to keep a check on all these factors in order to smoothen progress his business.", "Quantitative Analysis": "Quantitative analysis is a business or financial analysis technique that aims at understanding behavior through the use of complex mathematical and statistical modeling, measurement, and research. ", "R-Squared": "R-squared is a statistical measure that provides with data in percentage of a fund from the standard index or by definition the value of fraction of variance. The value of R-squared can vary from 0 to 100. If the R-squared of a security is 100, it denotes that all the movements of security are completely ascertained by the standard movement of market index.", "Ratio": "Ratio can be defined as one value divided by another. The resultant value is an indicator of the value of one quantity in other quantity’s terms.", "Ratio Analysis": "Ratio analysis is a tool brought into play by individuals to carry out an evaluative analysis of information in the financial statements of a company. These ratios are calculated from current year figures and then compared to past years, other companies, the industry, and also the company to assess the performance of the company. Besides, ratio analysis is used predominantly by proponents of financial analysis.", "Regression Analysis": "Regression analysis is the process of determining how the value of a dependent variable changes when any one of independent variable changes. The values of other independent variables do not change in this process.", "Residual Income (RI)": "", "Risk-Adjusted Discount Rate": "An estimation of the present value of cash for high risk investments is known as risk-adjusted discount rate. A very common example of risky investment is the real estate. Risk adjusted discount rate is representing required periodical returns by investors for pulling funds to the specific property. It is generally calculated as a sum of risk free rate and risk premium. The variation of risk premium is depending on the risk aversion of investor and the perception of investor about the size of property’s investment risk.", "Riskless Rate of Return": "Risk free rate of return refers to the theoretical rate of return of an investment involving zero risk. The riskless rate represents the interest expected by an investor from a completely riskless investment over a certain time period. ", "Seasonally Adjusted Annual Rate (SAAR)": "SAAS is a rate adjustment used for economic or business data that attempts to remove the data’s seasonal variations. ", "Sensitivity Analysis": "By keeping track of the changes in the external factors, necessary actions can be taken to prevent the losses. In order to keep track of the external changes, the entity needs to implement a method that will help it determine the sensitivity of its sales, costs and changes in its income patterns. This method is known as sensitivity analysis. The sensitivity analysis determines the changes in the quantifiable variables of the project to determine it viability.", "Sharpe Ratio": "Nobel Laureate William F. Sharpe has derived a formula that helps to measure the risk adjusted performance. As per definition, Sharpe Ratio helps in arriving at an answer which helps us analyse the risk that can be, and allowing you to make decisions on investments and also helps analyse the performance of a group.", "Solvency": "In finance, solvency refers to the extent to which the current assets of a business entity exceed its current liabilities. Solvency can also be defined as the ability of a business to congregate its long term fixed expenses in addition to accomplishment of long term growth and expansion.", "Solvency Ratio": "Solvency ratio is one of the various ratios used to measure the ability of a company to meet its long term debts. Moreover, the solvency ratio quantifies the size of a company’s after tax income, not counting non-cash depreciation expenses, as contrasted to the total debt obligations of the firm. Also, it provides an assessment of the likelihood of a company to continue congregating its debt obligations.", "Standard Deviation": "The general definition of standard deviation can be given as a measure of the dispersion of a set data from its mean.", "Standard Error": "The deviation from the actual mean of a population is known as the standard error. In statistics the standard deviation of the sampling distribution is known as the standard error.", "Statement Analysis": "", "SWOT Analysis": "SWOT analysis refers to a tool that recognizes the Strengths, Weaknesses, Opportunities, and Threats of an organization. Generally, SWOT is a basic, simple model that evaluates the capabilities of an organization as well as its potential opportunities and threats. The method of SWOT analysis is to obtain info from an environmental analysis and separate it into internal and external issues. Once this is accomplished, SWOT analysis determines what may help the firm in accomplishment of its aims and objectives, and also in overcoming or mitigating the obstacles to achieve desired results.", "Systematic Risk": "Systematic risk refers to the risk intrinsic to the complete market or the complete market segment. Systematic risk is also sometimes referred as “market risk” or “un-diversifiable risk”.", "Terminal Value": "Terminal value is the worth of your investment after a certain period of time. It is calculated by keeping factors like the current worth of asset, the rate of interests etc. In consideration yet assuming a stable rate of growth. Terminal value is sometimes also known as horizon value or continuing value. It is also used with the discounted cash flow (which calculates the firms worth for up to 3 to 5 years) to calculate the current worth of the firm or business. The terminal value of assets or of a company can be calculated beyond the time period of the discounted cash flow projection.", "Time Value of Money": "The time value of money refers to the value of money existing in a given amount of interest which is earned during a specific time period. The time value of money can be explained as the central concept in finance theory. Moreover, the concept of time value of money also helps in evaluating a likely stream of income in the future in a manner that the annual incomes are discounted and added thereafter, thereby providing a lump-sum present value of the complete income stream.", "Trend Analysis": "Trend analysis is one of the tools for the analysis of the company’s monetary statements for the investment purposes. Investors use this analysis tool a lot in order to determine the financial position of the business. In a trend analysis, the financial statements of the company are compared with each other for the several years after converting them in the percentage. In the trend analysis, the sales of each year from the 2008 to 2011 will be converted into percentage form in order to compare them with each other.", "Treynor Ratio": "Jack Treynor found the formula for the Treynor Ratio. It is the ratio that measures returns earned in surplus of which could have been earned on a risk free speculation per each unit of market risk. The excess return is the difference between a group’s return and the risk-free rate of return of the same period of time.", "Variable Costs": "Variable costs can be defined as expenses which keep changing in proportion to the activities of a business. Variable costs can be calculated as the sum of marginal costs over all units produced.", "Vertical Analysis of Financial Statements": "Vertical analysis of financial statements is a technique in which the relationship between items in the same financial statement is identified by expressing all amounts as a percentage a total amount. This method compares different items to a single item in the same accounting period.", "Weighted Average Cost of Capital (WACC)": "The Weighted Average Cost of Capital (WACC) can be explained as the rate expected to be provided by a company on average to all the security holders for financing its assets.", "Weighted-Average Cost Flow Assumption": "In this method of weighted average cost flow assumptions, the periodic inventory method is used, which is employed to compute the value of the inventory in addition to the costs of the goods sold. This cost that is the average of the total cost is based on the costs of goods available for sale in the inventory for the entire year. This average cost is then applied to the units that have been sold and the units that are still in the inventory.", "Absorption Costing": "Absorption costing, also known as full absorption costing, can be defined as a managerial accounting cost method of expensing all costs related to manufacturing of a specific product. The absorption costing method involves the use of total direct costs and overhead costs related to the manufacturing of a product as the cost base.", "Accelerated Depreciation": "Accelerated depreciation refers to a method of depreciation used for income tax or accounting purposes which allows higher deductions in the initial years of an asset’s life.", "Accounting Analysis": "Accounting analysis, also referred as financial analysis or financial statement analysis, can be explained as an assessment of the stability, viability, and profitability of a business, sub-business, or project. A financial analysis is carried out by professionals who prepare reports through the use of info obtained from financial statements and other reports. Besides, one key area of financial analysis is the extrapolation of company’s past performance into an estimate of its future performance.", "Accounting Estimate": "Accounting estimate is an approximation of the amount to be debited or credited on items for which no precise means of measurement are available. They are based on specialized knowledge and judgment derived from experience and training. They are used in the financial statements to determine the carrying amounts of assets and liabilities and the associated income or expense for the period where such amounts cannot be measured with precision and certainty.", "Accounting Policies": "Accounting policies are the specific principles, bases, conventions, rules and practices applied by an entity in preparing and presenting financial statements.", "Accounting Principles": "Accounting principles are the guidelines set by an accounting body that every entity must follow when they are preparing their financial statements. These accounting principles are mandatory to follow for the companies that are listed on the stock exchange and for other private companies also.", "Accounting Standards": "GAAP, short for Generally Accepted Accounting Principles, is the common set of accounting principles, procedures, and standards used by companies to compile their financial statements. GAAP are, therefore, a combination of authoritative standards and the generally accepted ways of recording and reporting accounting info.", "Accounts Payables": "Creditors rise when goods are purchased from the sellers on the basis of credit that is the cash isn’t pay at the time of transaction. These sellers or suppliers are called Creditors. They buy the goods but the cash or money is yet to be paid to them in the nearby future rather than at the moment of transaction. When accounts of such suppliers are made they are recognized as “Accounts payables”.", "Accounts Receivable": "When credit sales are made that is the cash isn’t waged at the time of sale of the business or the buyer, here the augmentation of debtors takes room. These buyers are called Debtors. The goods are sold to them but the cash or money is to be received from them in the nearby future rather than at the stage of the transaction. When accounts of such customers are made, they are recognized as “Accounts receivables”.", "Accrual Accounting": "Accrual accounting refers to the method of accounting which evaluates the performance and position of a company by recognizing economic activities irrespective of the occurrence of cash transactions. The main idea is that the economic activities are recognized by relating the revenues to the expenses at the time when transaction has occurred instead of when payment is received or made. Also, this method allows current cash flows (in and out) to combine with prospective cash flows thus providing a more accurate picture of the financial condition of a company.", "Acquisition Cost": "Acquisition cost concept applies to the obtainment of the fixed assets, so that an association might use for its commercial and business activities. Acquisition cost concept helps determine the actual expenses of an asset; it does not only include its purchase price but many other costs as well. Alternatively referred to as book value this cost is stated under the fixed assets section of the balance sheet. An assets acquisition cost might comprise many other costs other than the purchase price of an asset, any cost incurred to get an asset such as plant and machinery into a working state are considered a part of the asset’s acquisition cost. ", "Activity Based Costing (ABC)": "Activity based costing approach determines the cost of a product based on the activities performed during its production. ABC provides the opportunity for organisations that use cost based pricing to gain a greater understanding of their costs and to correct anomalies resulting from the distorted view given by conventional volume related costing.", "Adjusting Entry": "In accountancy, adjusting entries can be explained as journal entries which are made generally at the closing of an accounting period to apportion income and expenditure to the period in which they occurred actually. Putting it other way, adjusting entries are generally recorded after transactions which have occurred during a specific month, were journalized and posted from but have not yet been accounted for. This is done at the closing stages of each period when such data and all facts are fully on hand.", "Administrative Expenses": "Administrative expenses refer to the costs of operating a business that are not directly attributable to the production of goods or services. Administrative expenses are related to the organization as a whole as opposed to the individual departments.", "Affiliate": "The term \"affiliate\" refers to a type of inter-company relationship that involves one of the companies to own less than a majority of the stock held by the other company. Putting it other way, it can also be explained as a type of inter-company relationship wherein at least two individual companies are subsidiaries of a larger company.", "Amortization Schedule": "In accounting, amortization is similar to a depreciation method in which the amount decreases over the period. The accounting of this decreasing amount is amortization. If the company has taken out an amortization loan, it will need to make periodic payment for this loan.", "Annual Report": "An annual report can be delineated as an annual publication which must be provided to shareholders by public corporations to explain their operations and financial conditions. The obverse part of the report includes an exciting combination of graphics, photos, as well as an accompany narrative, each of which records the activities of the company in the previous year. The flipside part of the report includes detailed financial and operational info.", "Annual vs. Interim Statement": "The annual financial statements generally cover a time period longer than what is required to allow timely reporting to creditors and investors of a company. Interim financial statements, on the other hand, covering a period of less than one year (like a month or a quarter), have been developed to give a timelier source of information. However, interim financial statements are generally unaudited and in that case, they should be clearly labeled as ‘unaudited’ thus avoiding misleading the statement users.", "Asset Based Financing": "Asset based financing is a specialized technique of providing structured working capital and term loans which are tenable by accounts receivable, machinery, inventory, equipment, and real estate. ", "Authorized Capital": "Every company is authorized to issue and allocate some specific amount of capital shares to the share holders in that company. In other words this term is also referred to as the authorized share. ", "Authorized Shares": "Authorized shares are basically the maximum shares of stock, which an entity can issue. The company specifies this particular number in its charter. However, this can be altered with approval from shareholder. Usually, the number of shares that are authorized is much more than what is actually required in order to provide a company the opportunity to issue stocks further when required.", "Bad Debt Reserve": "Usually the bad debt reserve is considered as an option when the debtor who is liable to pay a specific amount of debt to the creditor but he or she is considered bankrupt. In some other cases the debt is considered as the bad debt reserve when the cost of pursuing of any further action regarding the retrieving of debt from the debtor. Then the debt is also considered as the bad debt reserve.", "Badwill": "There are many other ways to define this term. In fact the term badwill is the antonym of goodwill. It is also called as the negative goodwill. This situation usually arises when the individual pays the price for the company which is written in the balance sheet. It is also called as the book value of the company. Therefore the term badwill is often similarized with opposite of goodwill", "Balance Sheet": "Balance sheet is a snapshot of a company's financial condition at a specific moment in time, usually at the close of an accounting period. The balance sheet is the core of the financial statements (the other major financial statements are the income statement (statement of comprehensive income), statement of changes in equity and statement of cash flows). Unlike the other financial statements, balance sheet is accurate only at one moment in time, not a period of time.", "Bill of Exchange": "A bill of exchange refers to a written interest that does not bear any interest. A bill of exchange is generally used in international trade and aims at binding one party to pay a fixed amount of money to another party at a predestined future date. ", "Biological Assets": "International Accounting Standard 41 (IAS 41) defines biological asset as “a living animal or plant”.", "Bonus Depreciation": "Bonus depreciation refers to an additional amount of deductible depreciation which is awarded in addition to what is usually available. Bonus depreciation is always taken right away, in the first year that the depreciable item is put to use. This incentive type is proffered either as an extra incentive or as a measure of relief for small sized businesses which are seeking to purchase any additional equipment.", "Book Value": "The book value can be defined as the value at which an asset is passed on a balance sheet.", "Borrowing Costs": "Borrowing cost can be defined as interest and other costs incurred by an enterprise in relation to the borrowing of funds. Explaining in a more technical way, borrowing costs refer to the expense of taking out loan expenses like interest payments incurred from a loan or any other kind of borrowing. Interest also counts amortization of premium/discount on debt. ", "Borrowing Costs Eligible for Capitalization": "Borrowing costs essentially refers to the interest related costs. But borrowing costs eligible for capitalization as per IAS 23 are not merely interest related costs that are levied on borrowings done for short period, like bank OD’s (Overdrafts) and notes that are payable. It is also not the costs that are levied on borrowings for long-term like real estate mortgage and term loan.", "Burden Rate": "Burden rate is the indirect costs that are associated with either employees or the inventory of the company. In actuality, the burden rate is the rate with which indirect costs are allocated to the direct costs to make these indirect costs a part of the direct cost incurred. This rate is usually applied to the labor in the calculation of their payrolls or in calculation of inventory costs.", "Business Combination": "Generally, business combinations refer to transactions in which one company gains control, or at least controlling interest, in another company. A business combination can be aptly defined as amalgamation of the assets of two or more business entities for their consolidation as a single entity under single ownership. A business combination can be managed easily through the way of a voluntary acquisition, a merger, or a hostile takeover. In many cases, a preferred means of managing a business combination might be acquiring a controlling amount of stock.", "Capital Expenditure (CAPEX)": "The general definition of capital expenditure can be given as the funds utilized by a company for acquiring or upgrading the physical assets like property, equipment, or industrial buildings.", "Capitalized Cost": "Capitalized cost can be defined as an expense that is added to the cost basis of a fixed asset on the balance sheet of a company. The capitalized costs are incurred while financing or building fixed assets. However, these costs are not expensed in the periods of being incurred, but identified over a time period through the way of amortization or depreciation.", "Capped Rate (Capitalization Rate)": "Capped rate is also called as the capitalization rate. It is calculated and defined as the ratio and percentage division of the profit or income which is obtained by the asset to the income to the income obtained from the capital cost of the specific product.", "Cash Accounting": "Cash accounting can be explained as an accounting method which involves recording the receipts during the period of being received, and the expenses are recorded in the period of being actually paid for.", "Cash Advance": "Cash advance is the option provided to credit card holders to borrow money against their balances on the credit card. Most credit card users these days have found this option a very useful one as it helps them with many cash transactions. By definition, cash advance is a loan taken on a credit card, for which there is no charge of interest so all the borrower would be charged is with financing charge from the day the cash is borrowed up to the day when the amount is repaid in full.", "Cash and Cash Equivalents": "According to International Accounting Standard 7 (IAS 7), Cash “comprises cash on hand and demand deposits”. And cash equivalents “are short-term, highly liquid investments that are readily convertible to known amounts of cash and which are subject to an insignificant risk of changes in value”.", "Cash Flows from Financing Activities": "IAS 7 defines financing activities as the “activities that result in changes in the size and composition of the contributed equity and borrowings of the entity”.", "Cash Flows from Investing Activities": "IAS 7 defines investing activities as the activities that “are the acquisition and disposal of long-term assets and other investments not included in cash equivalents”.", "Cash Flows from Operating Activities": "IAS 7 defines operating activities as “the principal revenue-producing activities of the entity and other activities that are not investing or financing activities”.", "Clean Surplus Accounting": "\n", "Clearing Account": "Clearing account is a general ledger account, but it is not used for the posting purposes. This is an account, which is used to make a summary of similar transactions. This account is opened in the general ledger on temporary basis, and its purpose is that of a reminder. For example, an operating expense clearing account will be maintained to keep track of all the entries of operating expenses and to close the real operating expense account.", "Commodity": "Commodity is a general term for plenty of products used by the consumer. By Definition, a commodity is a physical substance, like grains or metals which is interchangeable with another product of the same type and which is bought and sold by investors through sales and purchases. The price of the commodity is set according to the demand and supply of that commodity.", "Common Shares": "Common shares can be aptly defined as securities in lieu of equity ownership in a corporation. These common shares provide voting rights and entitle the share holder to a share of the success of the company through capital appreciation and dividends. ", "Common-size Financial Statement": "Common size financial statements are different from the customary financial statements. Where the traditional financial statements are used for the reporting purposes and to report the monetary position of the company, the common size financial statements are used for the decision-making purposes. If an investor wants to compare the financial statements of two companies, there have to be some sort of scale to overcome the limitations of the comparisons and match the two unrelated business for investment purposes. Since the sizes of companies are not same, this usually leads to misleading and wrongful comparisons that affect the investments of the investors.", "Common-size Income Statement": "Common-size income statement is the type of income statements in which each item is reported as a reference to the revenue of the company. This method is executed by converting all the items of the income statements as a reference to percentage of the revenue. This is a method used for the analysis purpose.", "Completed Contract Method of Accounting": "Completed contract method of accounting is a method based on revenue recognition. This method is applicable for the lasting contracts, i.e., contracts spanning over more than one accounting period. In this method, the total contract revenue and the related costs incurred in the performance are recognizable in the period in which the contract is actually completed.", "Comprehensive Income": "According to IAS 1 \"Presentation of financial statements\", comprehensive income is the change in equity during a period resulting from transactions and other events, other than those changes resulting from transactions with owners in their capacity as owners. ", "Conglomerate": "In simple terms, conglomerate is a combination of two or more corporations in a single corporate structure. This forms a group of companies that usually involves a single parent company and different subsidiaries. However, in a conglomerate, diversification of the business in the companies is normal practice, and usually these companies depict a multi-industry corporate structure. These corporate structures are often multinational.", "Consolidated Financial Statement": "Consolidated financial statements refer to the financial statements which lead to the subsidiaries of the holding company its summative accounting figure. Putting another way, consolidated financial statements can be addressed as the combined financial statements of a parent company and its subsidiaries.", "Construction Contracts": "A construction contract can be explained as the warranty that ensures that the executed job gets the specific amount of compensation or the way compensation will be distributed. Moreover, a construction contract is negotiated specifically for the construction of an asset or a group of interrelated assets.", "Contingent Asset (Contingent Liability)": "Contingent asset is possible asset that arises from past events, and whose existence will be confirmed only by the occurrence or non-occurrence of one or more uncertain future events not wholly within the control of the entity.", "Continuing Operations": "Continuing operations refers to a business term which is used to define the divisions of the business of a company which is considered to be normal in addition to being expected to operate in for the near future. ", "Convertible Security": "A convertible security can be explained as an investment that can be changed into another form. The most common convertible security includes convertible preferred stock or convertible bonds, which can be transformed into common stock or equity. Moreover, a convertible security pays a sporadic fixed amount of money as a preferred dividend (in the case of convertible preferred shares) or a coupon payment (in the case of a convertible bond), and indicates the price at which it is convertible into common stock.", "Cost Method": "Cost method is a method of accounting for an investment, whereby the investment is recognized at cost. ", "Cost of Sales": "Cost of sales refers to the direct costs attributable to the production of the goods or supply of services by an entity. It is also commonly known as the “cost of goods sold (COGS)”.", "Cost Recovery Method": "The cost recovery method is basically a method for recognizing revenue as per which the gross profit is not recognized till the time the entire merchandise cost has been successfully recovered. Thus, initially the payments that the customers make are treated in the form of cost recovery of the goods that are sold. Thereafter, the remaining amount collected is considered to be gross profit.", "Current Assets": "Current assets are those assets that are expected to be used (sold or consumed) within 12 months.", "Current Liabilities": "Current liabilities are those to be settled within the entity's normal operating cycle or due within 12 months, or those held for trading, or those for which the entity does not have an unconditional right to defer payment beyond 12 months. Other liabilities are non-current liabilities.", "Debit and Credit": "The terms, debit and credit are the fundamentals of accounting that date back to almost 500 years ago. This system of segregating the transactions into debit and credit categories is a very old one, and it is still in effect, as one of the accounting fundamentals. This system of debit and credit is not only used for financial reporting purposes only. These terms are equally important in finance, taxation and management accounting.", "Debt Management": "Debt management refers to an unofficial agreement with unsecured creditors for repayment of debts over a specific time period, generally extending the amount of time over which the debt will be paid back.", "Declining-Balance Depreciation Method": "Declining-balance depreciation method is one of the most popular depreciation methods apart from the straight-line method. It is also known as reducing balance method. In this method, the depreciation charged to the asset in the early years of asset life is higher, and it gradually decreases as the years pass. This method continues to decrease the value of the asset over its useful life until at the end of assets’ life, all there is left is a residual value. This residual value is the scrap value at which assets can be sold in the market after its useful life is finished.", "Deferred Tax Assets (Deferred Tax Liabilities)": "Deferred tax liabilities are “the amounts of income taxes payable in future periods in respect of taxable temporary differences”. International Accounting Standard 12 defines deferred tax assets as “the amounts of income taxes recoverable in future periods in respect of...", "Defined Benefit Plan": "Defined benefit plan is basically a retirement related plan that is sponsored by the employer and where an employee’s benefits are determined on the basis of a formula utilizing factors like employment duration and history of salary. Managing portfolio and risking investment is completely under the entity’s control. Besides, restrictions with regard to how and when an employee can withdraw the funds without being penalized also exist for the plan.", "Defined Contribution Plan": "Defined contribution plan is basically a plan for retirement where a certain specified percentage or amount of money is kept aside every year by an organization for their employees benefit. There are several restrictions with regard to how and when an employee can withdraw this amount so that he isn’t charged with any penalties.", "Defined Contribution Plans": "International Accounting Standard 19 (IAS 19) defines defined contribution plans as “post-employment benefit plans under which an entity pays fixed contributions into a separate entity (a fund) and will have no legal or constructive obligation to pay further contributions if the fund does not hold sufficient assets to pay all employee benefits relating to employee service in the current and prior periods”.", "Depreciation (Amortization)": "\n", "Diluted Earnings per Share": "\n", "Direct Allocation Method": "Direct allocation method is a method for cost allocation. In this method, the costs of the manufacturing services department are allocated directly to the production department of the company and to the product itself. ", "Direct Costing": "Direct cost is the amount accredited for production of some goods or provision of services. In other words in a production process of a product, cost of labor, material and other expenses related to this production calls direct cost. Direct cost is related directly to the volume of production. It must be noted that the material cost is included in direct cost but cost of machinery is not a part of it. In this context, direct cost can be defined as the process of determining direct cost included in an operation or production.", "Direct Labor Cost": "Direct labor cost is essentially the work related expenses that can be attributed to the actual manufacturing of a product/good. In case of service industry, direct labor cost is referred to the labor cost needed for providing a particular service. Thus, direct labor cost does not involve employees who are not involved in the production, like office and administrative staff members. It only consists of personnel who are responsible for setting up as well as maintaining the equipment.", "Discontinued Operations": "The discontinued operations refer to the operations of a business which have been abandoned, sold, or else wise disposed of. As per accounting regulations, the continuing operations are required to be reported individually in the income statement other than discontinued operations.", "Disposable Income": "Disposable income is the gross or total income of a firm or individual from where direct taxes (including income tax, PAYE etc) have been successfully deducted. After deducting important expenses including clothing, food, shelter etc., the balance amount is called discretionary income, which the person who has earned it is free to save or spend. Besides, the disposable income amount is utilized for calculating a person’s debt to income ratio.", "Disposal Value": "Disposal value in accounting terms is the value of an asset or belonging, at which this asset should be sold or disposed off without incurring any loss to the company. For example, a machine has been installed in a factory and after a useful working on its life period needs to be replaced with a new model. The minimum value at which this machine should be sold without loss is called its book or disposal value.", "Distribution Costs": "Distribution costs (also known as “Distribution Expenses”) are usually defined as the costs incurred to deliver the product from the production unit to the end user.", "Double Entry Accounting": "Double-entry accounting is a system, which is used to record transactions in the daybooks for the accounting purpose. With the help of this system, the transactions are posted in the accounts, and financial statements are prepared. This system is one of the oldest and is said to be around for about 500 years. This is one of the most effective systems for recording transactions and is widely used by almost all the business in the world.", "Double-Declining-Balance Depreciation Method (DDB)": "It is a depreciation method in which the depreciation rate is applied double to that in straight line method. The depreciation in this method is charged on the complete purchase price of asset rather than the net of salvage value price in straight line method. In other words we can say that double declining depreciation method uses double the rate of straight line method.", "Earnings per Share (EPS)": "Earnings per share (EPS) is the portion of the company’s distributable profit which is allocated to each outstanding equity share (common share). Earnings per share is a very good indicator of the profitability of any organization, and it is one of the most widely used measures of profitability.", "Effective Interest Method": "Effective interest method is a method of calculating the amortized cost of a financial asset or a financial liability (or group of financial assets or financial liabilities) and of allocating the interest revenue or interest expense over the relevant period. ", "Employee Benefits": "Employee benefits can be explained as different non-wage compensations offered to employees other than their normal salaries or wages. Some good examples of these benefits are disability income protection, group insurance (health, life, dental etc.), housing, retirement benefits, tuition, daycare, sick leave, reimbursement, vacation, profit sharing, social security, education funding, and similar specialized benefits.", "Equity": "Equity is the portion of a company's assets that the shareholders own, as opposed to what they have borrowed. Equity is equal to total assets minus liabilities.", "Equity Instrument": "An equity instrument refers to a document which serves as a legally applicable evidence of the ownership right in a firm, like a share certificate. Equity instruments are, generally, issued to company shareholders and are used to fund the business. It is, however, not necessary that the issued equity must return a dividend for it is based on profits and the terms of business.", "Exchange Difference": "International Accounting Standard 21 (IAS 21) defines exchange difference as “the difference resulting from translating a given number of units of one currency into another currency at different exchange rates”.", "External Reporting": "External reporting requires an entity to provide well documented reports that can be circulated amongst the public and stockholders. Such a report does not include confidential information about the organization unless it is important to achieve a specific purpose. External reporting is also about furnishing shareholders and public with finance related information on a periodic basis in order to assist decision and control related process.", "Extraordinary Gain (Extraordinary Loss)": "In the income statement of the company, some events arise as extraordinary and non-recurring that are necessary to report. The reason for this is that the gain or losses are realized on these items and it is necessary to disclose them properly in the financial statements.", "Fair Value": "The international standards on accounting define the fair value as “the amount for which an asset could be exchanged, or a liability settled, between knowledgeable, willing parties in an arm’s length transaction”.", "FIFO": "FIFO, an acronym for First In, First Out, is a concept in ways of organizing and manipulation of data proportionate to time and prioritization.", "Finance Costs": "International Accounting Standard 23 defines finance costs as “interest and other costs that an entity incurs in connection with the borrowing of funds”.", "Financial Accounting": "Financial accounting refers to reporting of the financial position and performance of a firm by the way of financial statements issued to external users on intervallic basis. As explained by Investopedia, the main difference between financial and managerial accounting is that financial accounting is intended to provide info to parties outside the organization, while managerial accounting info is intended to help managers within the organization take decisions.", "Financial Accounting Standards Board (FASB)": "Short for Financial Accounting Standards Board, FASB is a seven-member independent board comprising of accounting professionals who aim at establishing and communicating standards of financial accounting and reporting in the US. The FASB Standards, commonly known as GAAP (Generally Accepted Accounting Principles), manage the preparation of corporate financial reports and are identified as authoritative by the Securities and Exchange Commission.", "Financial Instruments": "A financial instrument is a tradable asset of any kind which can be either cash, evidence ownership in an entity or a prescribed right to receive or deliver money or other financial instrument. According to IAS 32 and 39 it is defined as “any contract which will give rise to a financial asset of one entity and an equity instrument or financial obligation of another entity. Financial instruments can be thought of as an easily tradable package of capital, each having their own unique features.", "Financial Lease ": "A financial lease is a method used by a business for acquisition of equipment with payment structured over time. To give proper definition, it can be expressed as an agreement wherein the lessor receives lease payments for the covering of ownership costs. Moreover, the lessor holds the responsibility of maintenance, taxes, and insurance.", "Financial Report": "Financial report can be defined as a set of documents prepared generally by companies or government agencies at the closing of an accounting year. Usually, it includes summary of accounting data for that year, including background notes, forms, and other related info. Putting it other way, a financial report is a formal record of a business, entity, or individual’s financial activities.", "Financial Statement": "A financial statement can be well defined as a formal record of any business’, individual, or entity’s financial activities. ", "Financial Statement Transparency": "Transparency in financial statement means the statement should be users friendly and clear, everything should properly be disclosed and that should be easily understandable. ", "Finished Goods Inventory": "Finished goods: In this part of the manufacturing process, all the work on the inventory is completed, and it is turned into the finished good and is ready to be sold.", "Fixed Asset": "Fixed asset is a long-term tangible piece of property that a firm owns and uses in the production of its income and is not expected to be consumed or converted into cash within 12 months.", "Fixed Assets": "A fixed asset can be defined as a long-term tangible property piece owned by a firm and used for the purpose of income-generation. A fixed asset is not expected to be consumed or converted into cash before a time period of one year.", "Fixed Capital": "Fixed capital is clearly referred to as the physical capital or a real capital which is not consumed or invested in the production of any real product.", "Foreign Currency Translation": "Foreign currency translation refers to converting the accounting figures declared in one currency into another for financial reporting purposes. As per the US GAAP regulations, the items on balance sheet are converted at the exchange rate existing on the balance sheet date. Also, items on income statement are converted as per the weighted-average exchange rate for the specific year.", "Forensic Accounting": "Forensic accounting is also known as financial forensics or forensic accountancy which refers to a special area of expertise of accountancy in which engagements that are the outcome of anticipated or actual litigation or disputes are described. The meaning of forensic is “suitable for use in a court of law”, and the forensic accountants usually have to work to that potential and standard outcome. Forensic accountants are also known as investigative auditors and forensic auditors and they are often required at eventual trial to provide expert evidence. Specialist Forensic accounting departments are present in all the large accounting firms and also in many medium sized firms. A forensic accounting department may be further sub divided into various specializations, such as forensic accountants may specialize in personal injury claims, construction, insurance claims, royalty audits or fraud.", "Forward Contract": "Forward contract can be defined as a cash market transaction which involves the delivery of the commodity being deferred until after the contract has been created.", "Forward Rate": "Forward rate is defined as the rate which is applicable to any situation of financial transaction. This is the rate of capital which is applicable to be taken place in future.", "Fraudulent in Financial Reporting": " It’s basically the intentional effort to misstate the information in the financial statement. The purpose behind this fraud may be to conceal the internal transactions of the financial events which benefit the fraud making employee of the company. Another reason behind making the financial statement un-transparent is to give the fruitful view of the firm to the investors with the aim of attracting them. This practice of fraud abuses the public and concerned parties like the government to avoid high tax.", "Free Cash Flows": "After a company has finally paid off all the expenses including the investments the amount of cash that is left is known as free cash flow. It may also be known as operating cash flow minus capital expenditures. Free cash flow is actually the net cash that is left after paying off all the expenses.", "Functional and Presentation Currency": "", "Generally Accepted Accounting Principles (GAAP)": "Generally Accepted Accounting Principles (GAAP) refers to a widely accepted set of rules, standards, conventions, and procedures for reporting financial info.", "Going Concern": "Going concern refers to a term for a company which holds resources required to continue with operations indefinitely. If a company is not a “going concern”, it indicates that the company has gone bankrupt. The term is also referred as “Going Concern Value.” The ‘going concern’ concept presumes that the business will exist long enough for all the assets of the business are utilized to the fullest.", "Goodwill": "As explained by Investopedia, goodwill is looked at as an ethereal asset on the balance sheet for it is not a physical asset like equipment and buildings. Generally, goodwill represents the value of intangible assets like good customer relations, strong brand name, good employee relations, and any kind of patents or proprietary technology. Goodwill generally arises at the time of one company being purchased by another.", "Government Accounting Standards Board (GASB)": "Government Accounting Standards Board (GASB) is an organization that aims at improving and creating accounting and reporting related standards or GAAP. ", "Gross Profit (Gross Margin)": "", "Historical Cost": "The Framework of International Accounting Standards Board (IASB) defines historical cost as “A measurement basis according to which assets are recorded at the amount of cash or cash equivalents paid or the fair value of the consideration given to acquire them at the time of their acquisition. Liabilities are recorded at the amount of proceeds received in exchange for the obligation, or in some circumstances (for example, income taxes), at the amounts of cash or cash equivalents expected to be paid to satisfy the liability in the normal course of business.”", "IFRS Main Financial Statement Forms": "The IFRS financial statement forms include the following: a Statement of Financial Position, a Statement of Comprehensive Income ...", "Impairment of Assets": "Impairment of assets can be explained as a sudden or unexpected decline in an asset’s service utility, like factory, vehicle, or property. This might result from physical damage to the asset, changes to the legal code, or obsolescence resulting from technological innovation. It is, however, possible to write off impairment of assets.", "Income Statement (Profit and Loss Statement)": "Income statement is a financial statement that summarizes the various transactions of a business during a specified period, showing the net profit or loss. Income statement measures a company's financial performance over a specific accounting period. It is often referred as a profit and loss statement (P&L). ", "Incremental Cost": "Incremental cost can be defined as the encompassing changes experienced by a company within its balance sheet because of one additional unit of production. This is also referred as ‘marginal cost’.", "Independence Standards Board (ISB)": "The Independence Standards Board (ISB) came into existence in the month of May in 1997 owing to discussions held between the AICPA and SEC. The numerous securities related laws that were enacted by the Congress and managed by the SEC state that the credibility and integrity of the finance related reporting procedure for public entities depends, largely, on the auditors that operate independently from their auditing customers.", "Intangible Asset": "An intangible asset is an identifiable non-monetary asset without physical substance (IFRS, IAS 38). Intangible assets cannot be physically seen or touched.", "Intellectual Property": "\n", "Intercompany Eliminations": "Intercompany elimination refers to the process for removal of transactions between companies included in a group in the preparation of consolidated accounts.", "Interim Financial Statement": "The interim financial statement is applied in order to convey the performance of a financial company before the beginning of a fiscal year and at the end of a fiscal year.", "International Accounting Standards Board (IASB)": "Being founded on February 6, 2001, as an independent accounting standard setter, the IASB is a London-based organization which seeks out to set and enforce standards for accounting procedures. At present, more than 100 countries require or permit companies to comply with IASB standards. Moreover, IASB is also responsible for maintaining the IFRS (International Financial Reporting Standards). The organization was preceded by the IASC (International Accounting Standards Committee) being the parent entity.", "International Financial Reporting Standards (IFRS)": "International Financial Reporting Standards (IFRS) are principles-based Standards, Interpretations and the Framework adopted by the International Accounting Standards Board (IASB). IFRS represent a set of internationally accepted accounting principles used by companies to prepare financial statements.", "Inventories": "\n", "Inventories: International Accounting Standard (IAS) 2 Overview ": "The revised IAS 2 inventories or International Accounting Standard 2 Inventories has replaced IAS 2 inventories in 1993. These standards were applied annually from January 1, 2005. It superseded the earlier SIC-1 Consistency-Different Cost Formulas for Inventories...", "Inventory Accounting": "Inventory Accounting refers to the part of accounting dealing with assessing and accounting for changes in inventoried assets. These changes in value can be a result of various reasons like deterioration, depreciation, obsolescence, increased demand, change in customer taste, decreased market supply, and similar more.", "Inventory Financing": "Inventory financing refers to a line of credit or short-term loan made to a company for purchasing products for sale. ", "Investment Property": "IAS 40 defines investment property as the “property (land or a building — or part of a building — or both) held (by the owner or by the lessee under a finance lease) to earn rentals or for capital appreciation or both, rather than for:", "Issued Capital (Share Capital)": "Issued (share) capital is the amount of nominal value of share held by the shareholders. It is the face value of the shares that have been issued to the shareholders. Issued share capital and share premium represent the amount invested by the shareholders in the company. It is also known as the subscribed capital or subscribed share capital (US - stock capital).", "Just-in-time Inventory Systems": "Just-in-time inventory strategy can be referred as a production strategy which is employed to increase the level of efficiency and reduce waste by receiving goods only in the form they are required in the production process, thus reducing the inventory costs. This method calls for the producers to be capable of forecasting demand accurately.", "Lease": "To give the legal definition of a lease, it can be rightly stated that it is a written agreement wherein the owner of a property allows a tenant to use his property for a specific time period with a certain amount of rent.", "LIBOR": "Short for London Inter-Bank Offer Rate, LIBOR is defined as the interest rate charged by one bank from another for loans (generally in Eurodollars). ", "LIFO": "An acronym for Last in, First out, the LIFO method presumes that the assets acquired or produced last are sold, used, or disposed of first.", "Liquidation Value": "Liquidation value can be defined as the estimated amount of money that could be received quickly through the sale of an asset or a company. Put another way, the liquidation value refers to the worth of the physical assets of a company as it steps out of business or if it were supposed to go out of business.", "Long-term Liabilities": "Long-term liabilities refer to the category of debts presented on the balance sheet of a company which are required to be repaid during the upcoming twelve months, but that instead are required to be paid back within a year or more.", "Mark to Market": "Mark to Market is used for measuring the fair values of those accounts, which could alter over time, like liabilities and assets. Mark to Market focuses on providing a practical appraisal of a company’s or an institution’s existing financial condition. ", "Market Value": "Market value refers to the price at which an asset is traded in the competitive auction setting. The apt definition for market value is the current quoted price at which a share of common stock or a bond is bought or sold by the investors at a specific time. The market value is, sometimes, also referred as “total market value”.", "Merchandise Inventory": "Merchandise inventory is essentially the goods, which the distributor, retailer or wholesaler acquires from the suppliers, with an intention of selling them to 3rd parties. If the goods are sold off during an accounting cycle, then the costs of these goods are charged to the price of the goods that have been sold and it is treated as expenditure in the income statement in the cycle in which the sale took place. If these very goods aren’t sold in an accounting cycle, then the prices of these goods are registered in the form of a current asset and they continue to feature in the balance sheet till the time they are all sold off.", "Minimum Lease Payments": "Minimum lease payments are “the payments over the lease term that the lessee is or can be required to make, excluding contingent rent, costs for services and taxes to be paid by and reimbursed to the lessor, together with...", "Minority Interest": "Also referred as Non-controlling interest in business, minority interest is an accounting concept that deals with the part of a subsidiary corporation’s stock which is not owned by the parent corporation. Moreover, the enormity of the minority interest in the subsidiary company is usually less than 50% of outstanding shares, or the corporation would normally stop being a subsidiary of the parent corporation.", "Net Assets": "The term \"net assets\" is the alternative term for \"equity\" (i.e. the total assets of a business minus its total liabilities). ", "Net Book Value": "The net book value can be defined in simple words as the net value of an asset. To define net book value, it can be rightly stated that it is the value at which the assets of a company are carried on its balance sheet.", "Net Realizable Value": "Generally, in the field of accounting, the net realizable value is a technique used to calculate the worth of an asset while in inventory. To define the net realizable value in a proper way, it can be stated as the value of an asset which can be realized by a business entity or company upon the sale of asset, minus a logical prediction of the costs associated with either the ultimate sale or the disposal of the asset in question.", "Net Sales": "Net sales refer to the amount of sales engendered by a business after deducting the returns, taxes like VAT, allowances for damaged or missing goods, and any discounts allowed. The sales number mentioned on the financial statements of a company is the net sales number, replicating these deductions.", "Net Worth": "Net worth is the difference between a company's total assets and its liabilities. ", "Nominal Value": "Nominal value refers to the stated value of an issued security that remains permanent as compared to its market value, which is fluctuating by nature because of factors like inflation.", "Non-controlling Interest (NCI)": "International Accounting Standard 27 (IAS 27) defines non-controlling interest as “the equity in a subsidiary not attributable, directly or indirectly, to a parent”. The similar term \"minority interest\" was previously used in standards.", "Non-Current Assets": "Non-current assets are assets that include amounts expected to be recovered more than 12 months after the reporting period.", "Non-Current Liabilities": "Non-current liability is a liability not due to be paid within 12 months during the normal course of business. Non-current liabilities are also called long-term liabilities. In accounting, non-current liabilities are shown on the right wing of the balance sheet representing the sources of funds, which are generally bounded in form of capital assets.", "Normal Costing": "Normal costing is a method of costing that is used in the derivation of cost. The components used for the normal costing to derive the cost are actual costs of material, actual costs of labor and standard overhead rate that are used for allocation purpose. Since the normal costing makes use of standard overhead rates instead of actual overhead rates, this method is used in determining the product costs where there is no sudden increase in the costs. This method of normal costing is also generally accepted, and it is allowed to derive the cost of product using this technique under GAAP and IFRS.", "Off Balance Sheet (OBS)": "Off balance sheet refers to the assets, debts or financing activities that are not presented on the balance sheet of an entity.", "Operating Expenses": "Operating expenses are the expenses that are incurred in the natural course of business. These expenses generally consist of the selling and administration expenses. These expenses are revenue in nature since these are incurred in the day-to-day operations of the business and do not incur on the non-current assets.", "Operating Income": "Operating income is the income reported in the income statement of the company before taking account of the interest and taxation. In accounting and finance, this operating income is also known as earnings before interest and tax (EBIT) or profit before interest and tax (PBIT).", "Operating Lease": "Operating lease is, basically, a lease contract which allows the use of an asset, but rights similar to asset’s ownership are not conveyed. According to Investopedia, an operating lease is not capitalized. It is, rather, accounted for as a rental expense. Explaining in simple words, an operating lease is a lease which features a short term as compared to the useful life of the asset or equipment which is being leased. Generally, an operating lease is used for acquiring equipment on comparatively short-term basis.", "Operating Segments": "\n", "Overhead Costs": "Variable overheads are the costs that are constant when calculated per unit but become variable when totaled to the volume of the output. All costs like repairs and maintenance, indirect labor, etc., are variable overhead costs.", "Pacioli": "Fra Luca Bartolomeo de Pacioli was an Italian mathematician, born in 1445 and died in 1517. He was a seminal contributor to the field of accounting, although accounting was not labeled as a discipline in his time.", "Par Value": "The par value can be defined as the face value or stated value of a bond. If put another way, it is generally a dollar amount that is assigned to a security while representing the value contributed for each share in cash or goods.", "Percentage-Of-Completion Method of Accounting": "Percentage-of-completion method of accounting is based on the revenue recognition principle that provides with a framework on how to recognize revenue and expenses in the accounts of the company. The percentage-of-completion method is generally required method for the bigger construction companies for the financial accounting and taxation purposes. These companies use this method for the long-term contracts. This method’s justification relies on the matching principle in accounting, according to which it is necessary to match the revenue and expenses in the valid accounting time. ", "Perpetual Inventory": "Perpetual inventory is a system in which the book inventory of the business is kept up to date to the actual inventory of the business. In this system, the complete information on the inventory and its availability is present in the books of the business. This system has made it easy to conduct business and with the help of this system, book inventory becomes almost the same as the actual warehouse inventory. This system works by interconnecting the purchase and the point-of-sale system. This helps the business in updating the inventory by altering the levels when an order is placed or sale is made.", "Perpetual Inventory System": "The Perpetual Inventory System can be defined as keeping the records of the stocks. You have to keep a balance of the stocks which are present as materials in the business along with the ledger records kept in a book. According to the English dictionary the word Inventory is associated with the materials which are present in the business for resale. The materials present should match with the ledger book otherwise the entire book becomes a trash. This is done to expedite the record keeping of the stores books.", "Post-Closing Trial Balance": "Preparing a balance sheet is the inherent part of all accounting procedures. You have to maintain a proper balance sheet in your organization in order to keep all the transactions secure and safe. The method of book keeping is also known as trial balance.", "Post-employment Benefits": "International Accounting Standard 19 (IAS 19) defines post-employment benefits as “employee benefits (other than termination benefits) which are payable after the completion of employment”.", "Post-Retirement Benefit": "Post-retirement benefits are for people who has served or worked to achieve a lifetime benefit for themselves. This is one form of retirement pension that is paid to the employees in their retirement years.", "Pro Forma Invoice": "Pro forma invoices are used by various businesses in almost all industries. A pro forma invoice can be referred as an introductory bill of sale sent to buyers in advance of a shipment or delivery of goods.", "Process Costing": "Process costing is a costing method used when it is not possible to identify separate units of production, or jobs, usually because of the continuous nature of the production processes involved. Process costing traces and accumulates direct cost, and allocates indirect cost incurred during a manufacturing process.", "Production Cost": "Cost of production refers to the total sum of money needed for the production of a particular quantity of output.", "Profit Center": "A profit center is a division within the entity that is treated separate from the corporation. A profit center is a stand-alone section of the corporation that is required to generate its own profits and perform its own accounting", "Profit Distribution": "In any place of profit generation and revenue production, the profit generated consequently as a result of this business is then distributed according to the final calculations. This is meant about the profit distribution.", "Property, Plant and Equipment (PPE)": "\n", "Provisions": "International Accounting Standard 37 (IAS 37) defines a provision as “a liability of uncertain timing or amount”.", "Public Company Accounting Oversight Board (PCAOB)": "\n", "Public Oversight Board (POB)": "The public oversight board was created in the year 1977 by the AICPA in the USA. The board is private based independent governing body that reports and monitors the various accounting profession’s programs that are self-regulatory programs for independent auditors who are registered with the Securities and Exchange commission. There is a much needed improvement coming towards the board that will improve and strengthen the policies of the board.", "Purchase Method of Accounting": "Acquisition accounting, also popularly known as a purchasing method of accounting was used in the accounting standards. This term is mostly common in terms of acquisitions and mergers. The purchase methods lists the fair value of the acquired company.", "Push-Down Accounting": "In accounting, when entities are preparing accounts for acquisitions and mergers, the subsidiaries are usually purchased at their purchase cost rather than their historical cost. This technique of accounting is known as push down accounting.", "Qualifying Asset": "Qualifying asset is “an asset that necessarily takes a substantial period of time to get ready for its intended use or sale”.", "Raw Materials": "Raw materials can be explained as substance or material used in the manufacturing or primary production of goods. Generally, raw materials are natural resources like oil, wood, and iron. Raw materials are often altered for use in various processes prior to being used in the manufacturing process. Raw materials are also referred to as commodities, which are purchased and sold on commodities exchanges throughout the world.", "Realized Profit (Realized Loss)": "A Realized Profit (Loss) is mainly defined as the capital gain or loss which the business is likely to produce in the entire year. It is completely different from the paper profits or daily profits. Daily profit which is also known as paper profit in common parlance is the amount which a company or a business gains daily after subtracting the amount invested in business. But the Realized Profit (Loss) is the loss or gain at the end of the year. It is a taxable income of the business making it so vastly different from the paper profits.", "Reconciliation": "This term is also synonymous with the term Bank Reconciliation Statement which refers to the balancing of two accounts for the sake of checking how much amount of actual money is spent. This is mainly done by matching the two accounts at the end of the accounting period.", "Redemption Value": "Redemption Value is considered as the value by which the company can again purchase the security much before the time it gets matured. It is good to know that the bond can be purchased by any company at a great discount if the value of redemption exceeds the price of the purchase. Moreover, one can obtain the buy at a premium value if the purchase price is more than the redemption value.", "Residual Value": "The residual value of an asset or property can be simply explained as the worth of an asset at the end of its lease period or useful life. It is one of the major and significant elements of leasing calculus. In accountancy, residual value is also called salvage value which is the fully depreciated worth of an asset.", "Retail Method": "When you are considering the financial aspects of any particular company or store, it is necessary that you take into consideration the procedure of accounting that is imperative to estimate the value of the merchandise in the store. The total inventory value of the company gets calculated by the particular method. There are many stores and the companies that can use the inventory method quite economically with some specific identification.", "Retained Earnings": "Retained earnings are the profits generated by a company that are not distributed as dividends to the shareholders. The retained earnings are the sum of profits that have been retained by a company since its inception. They are reduced by the losses. Retained earnings are also known as accumulated surplus, accumulated profits, accumulated earnings, undivided profits and earned surplus.", "Revenue": "\n", "Salvage Value": "Salvage value is the projected value that an asset will realize on its sale at the end of its useful life. The price is used in accounting for decidingthe depreciation amounts, and in the tax system to determine the deductions.Salvage value is the projected resale value of an asset at the close of its useful life. You deductthe salvage value from the cost of a fixed asset to decide the quantity of the asset price that you will depreciate. Thus, salvage value is solitary used as a component of depreciation calculation.", "Securities and Exchange Commission (SEC)": "The Securities and Exchange Commission (SEC) was set up by the US Congress in 1934 as an individual, quasi-judicial regulatory agency during the period of Great Depression which followed the crash of 1929. The basic reason for establishing SEC was to regulate the stock market and avert corporate abuses associated to the contribution and sale of securities and corporate reporting. The SEC holds the power of licensing and regulating stock exchanges, the companies whose securities traded on them, and the dealers and brokers who carried out the trading.", "Share Premium": "Share premium is the amount received by a company over and above the face value of its shares.", "Shareholders Equity": "Shareholders equity is the difference between total assets and total liabilities. It is also the Share capital retained in the company in addition to the retained earnings minus the treasury shares. Shareholders equity is the amount that shows how the company has been financed with the help of common shares and preferred shares. Shareholders equity is also called Share Capital, Stockholder’s Equity or Net worth.", "Statement of Cash Flows": "The statement of cash flows can be explained as one of the financial reports which are required to be disclosed according to  IFRS and US GAAP. This document provides summative data regarding all inflows of cash received by a company from its ongoing operations as well as external investment sources. Besides, cash outflows paying for business activities as well as investments during a specific period are also included in the statement of cash flows.", "Statement of Changes in Equity": "A statement of changes in equity can be explained as a statement that can changes in equity for corporation features be created for partnerships, sole proprietorships, or corporations. The key purpose of this statement is to summarize the activity in take equity accounts for a certain period. Sole proprietorships and partnerships follow a similar format for their statements of changes in equity. ", "Statement of Comprehensive Income": "Comprehensive income is the change in equity (net assets) of a business enterprise during a period from transactions and other events and circumstances from non-owner sources. The statement of comprehensive income illustrates the financial performance and results of operations of a particular company or entity for a period of time.", "Statement of Financial Position": "Statement of financial position is the new name of the balance sheet used in IFRS.", "Stockholder": "A shareholder or stockholder of a company or organization is an individual or another organization (including a corporation) that legally owns partial or full stock in a public or private corporation. ", "Straight-Line Method of Depreciation": "Straight-line method of depreciation is the most popular and simple method of depreciation. In this method, the purchase price or the acquisition value of the asset is divided by the useful life of the asset after deducting the scrap value from the value of an asset.", "Subsidiaries, Joint ventures and Associates": "A subsidiary is an entity, entity that is controlled by another entity. A joint venture is a joint arrangement whereby the parties that have joint control of the arrangement have rights to the net assets of the arrangement. An associate is an entity over which the investor has significant influence", "Temporal Method": "The temporal method can be defined as a method of translating foreign currency through the use of exchange rates based on the time of acquisition of assets and liabilities. The exchange rate involved also depends on the valuation method being used. For assets and liabilities valued at current costs, the current exchange rate is used. On the contrary, the assets valued at historical costs involve the use of historical exchange rates.", "Transaction Costs": "A transaction cost is the term that refers to the cost incurred in the process of carrying out a transaction. To understand the term better, here is an example: if you are in a shop purchasing a television set, you will need to research on the various vendors and different television sets. You will need to visit various stores, collect information, other consumers’ preference, ratings of the products, etc. Apart from the cost of the television set, all this effort and energy you put in the purchase process is the transaction cost.", "Treasury Shares": "Treasury shares are the shares which are bought back by the issuing company, reducing the number of shares outstanding on the open market.", "True Interest Cost (TIC)": "True Interest Cost (TIC) is the real cost of taking a loan. True interest cost includes all the subsidiary costs like late fees, discount costs, prepaid interest, and finance charges along with all the other factors that are related to the value of money. It can also be referred to the It can also refer to the real cost of issuing of the bond. The borrowers of the bond are entitled to all the true information about the bond.", "Units of Production Method of Depreciation": "This method of depreciation is different from the other method that reduces the life of an asset based on the numbers of years it has left as its useful life. In the unit of production depreciation, as the name suggests, the depreciation of the assets is based on the number of units it produces rather than the number of years of useful life left. Due to the depreciation calculation based on its activity, this method is also sometimes referred to as units of activity method. Simply put, in this method of depreciation, the useful life of assets depends on its productivity and its ability to produce the total number of units.", "Unrealized Gains & Losses": "An unrealized loss exists when the value of stock decreases after being purchased by an investor but he/she has not yet sold it. ", "Unsecured Debt": "Unsecured debt is the famous term used by the finance specialists. Unsecured debt is referred to as the type of debt or general obligation which is not applied in collateral efforts on the specific assets of the borrower. This usually occurs in cases when the borrower is declared bankrupt or he or she fails to meet the terms for the repayment of the loan or debt.", "US GAAP": "The Generally Accepted Accounting Principles in the US (US GAAP) refer to the accounting rules used in United States to organize, present, and report financial statements for an assortment of entities which include privately held and publicly traded companies, non-profit organizations, and governments. The term is confined to the US and is, therefore, generally abbreviated as US GAAP. But theoretically, the term \"GAAP\" covers the entire accounting industry, rather than only the US.", "US GAAP vs. IFRS": "The main points of comparison between US GAAP and IFRS include...", "Work in Progress (WIP)": "Work in progress (WIP) is the part of inventory that is currently being worked on and is yet in the production process.", "Accelerated Buy Backs": "An accelerated buy back, also called an accelerated share repurchase, is a gimmick used by companies who desire a way to generate cash for their shareholders without going through the formalities of a traditional buy-back program and without throwing their balance sheet out of kilter. For those companies without preferred stock who have a good supply of cash on hand, it is a way to reward their investors without the costs normally associated with premium stock shares.", "Acquiree": "Acquiree is the term used to call the subject matter of sale that is being sold. For example if a company is being traded or sold the subject matter of the sale means all that is part of the sale. It can also be called the ‘target firm’ which is being acquired or purchased.", "Acquirer": "An acquirer can be a person or a corporation gaining financial control over some other corporation permanently. This acquisition is done by giving cash or stock in exchange, to gain the rights over that corporation. It can also be understood with the example that an acquirer is a financial institution which is approached to approve a credit or debit card purchase. The acquirer will either reject the purchase or accept it by placing money into the sellers account. With the payment that the acquirer gives for the subject matter he then becomes the rightful owner and the ownership in the property is legally transferred to that person or firm.", "Act of Bankruptcy": "Bankruptcy Act also called as the Insolvency Act is defined as the decree according to which there is a lawful practice of the bankruptcy laws to curb this menace especially in Canada. ", "Adam Smith": "Adam Smith is the pioneer name in the field of political economy. Basically he was a Scottish philosopher and was a moral dignitary. His main contribution was towards the establishment of the political economy. He has been the main figure who played a very positive and productive role during the times of Scottish Enlightenment.", "Adhocracy": "The term adhocracy is commonly defined as \"a form of organization that operates differently from the normal bureaucratic lines to explore opportunities, resolve the issues, and get better outcomes\". ", "Arbitrage": "In finance, arbitrage refers to the practice of taking advantage of a of the difference between the prices of two or more markets – striking an arrangement of matching deals that capitalize upon the difference, the profit being the difference between the market prices. While being used by the academics, an arbitrage refers to a transaction involving no negative cash flows at any temporal or probabilistic state and a positive cash flow in at least one state. Putting it simple, it is the possibility of a risk free profit at zero cost.", "Asset Restructuring": "Different companies have established the asset reconstruction and restructuring authorities and organizations in several countries. Various multi national companies in different countries are working in this field and are also establishing the asset restructuring phenomena...", "Balance Theory": "Balance theories might be of two types, the credit balance theory and the debit balance theory. The credit balance theory indicates the cash balances and the brokerage accounts of the investor that help in forecasting the trends in the market. This theory indicates that those investors who have cash in their accounts usually use that cash for buying marketable securities. When they will go to purchase them, then the demand for the securities will increase in the local markets which will ultimately increase their prices.", "Bare Trust": "Bare Trust is defined as the basic trust in which the beneficiary has the complete right to the assets within the trust, along with the income generated from these assets. Bare trusts are extensively used by parents and grandparents for handing over the assets to their children or grandchildren. Trust assets are alleged in the name of the trustee, who has the duty to manage the trust assets in a sensible way so as to create maximum profit for the beneficiaries. The trustee does not have any control over these assets and has no say in directing the trust's revenue or capital. It is also known as a simple trust.", "Barter": "Barter can be describes as an act of trading goods and services between two or more than two parties without involving the use of money. Bartering is beneficial for a companies and countries that see a mutual benefit in exchanging goods and services instead of cash, in addition to enabling those who are short of hard currency to obtain goods and services. The barter system is generally bilateral, but might also be multilateral, and by and large exists parallel to monetary systems in most developed countries, although to a very limited extent.", "Benchmark Interest Rate": "Various banks in the world have given their own benchmark rates for interest. Benchmark interest rate is defined as the minimum rate of interest which is liable to be accepted by the investors especially when they are willing to invest money in the non treasury security.", "Beneficiary": "In trust law known as ‘cestui que use’ a beneficiary can be natural person or an entity of legal stature who is entitled to receive money or other assistances from another person known as his ‘Benefactor’. ", "Bond": "A bond refers to a debt investment wherein an investor lends money to a business company (governmental or corporate) that borrows the funds for a specific time period at a fixed interest rate. ", "Bribery": "Bribery is the biggest evil for any community and it also impacts the overall economy of that region. Bribery is defined as the gift granted to any individual, community or the organization for which in against the person who granted the gift ask for some favor. The favor usually which are asked by the person who granted the gift are illegal, which is against eh merit system or it can be the short cut method of achieving something for which the rules and other regulations are not been followed. Bribery kills the faith among the person and thus the whole community becomes money hunger.", "Bridge Loan": "Basically the bridge loan is the interim financing strategy based loan and it offers the financing of an individual or a business. This is done so that the next stage of financing until the next stage of the financing is obtained.", "Budget Constraint": "A budget constraint refers to all the combination of goods and services that can be purchased by a consumer with his or her income at their given prices. The concepts of a preference map and a budget constraint is used by the consumer theory for analyzing consumer choices.", "Budgetary Slack": "Budgetary slack is an allowance set for any extra expenditure that the entity is going to incur in the fore coming period. This is a practice where an ample amount of intentional allowance is introduced in the budget for any other or miscellaneous expenditure the business is going to sustain.", "Bureaucracy": "", "Burn Rate": "Burn rate is the term which is used in synonym for the cash flow in negative or opposite direction. Basically it is the measure of the speed of a company to use or consume the capital of a share holder.", "Business Plan": "A business plan is a decision making tool which can be delineated as a formal statement of a set of business goals, the reasons for they being achievable, and the plans for achieving these goals. Moreover, a business plan may also consist of background information about the organization attempting to achieve the goals.", "Business Process Reengineering": "The process of assessing and then redesigning the flow of work within the business or between businesses is known to be the business process reengineering. In the fast changing global market the strategies and goals of businesses keep changing to keep up with the modern globalised market structure. To keep in sync with the goals of business there is a need to keep the business ‘lean and fit’ thus cut off all the excess joints in the workflow which are unprofitable for the business and reduce the overall efficiency in order for the business to become a strong force in the highly competitive market now days.", "Capital Account": "The term capital account is used most frequently in the field of macroeconomics and international finance and monetary matters. It is also known as the financial account. Therefore both the terms can be used for this thing.", "Capital Accumulation": "Capital accumulation means collecting or gathering of objects that have value, increasing wealth by concentrating it or creating of wealth. Capital refers to money or any financial asset that is utilized for generating money. The generated money can be received in the form of interest, profit, rent, capital gain, royalties or any other type of return. This activity is the foundation of the economic system of capitalism in which all the economic activities are planned and prepared around accumulating the capital. That is to say, all investments are made for realizing financial profit.", "Cash Generating Account": "Various banks and financial institutions have come up with the establishment of the cash generating units and accounts. Basically these units and accounts are subjected to the testing of annual impairment if there exists any in the banking systems and the accounts.", "Cash Limit": "\n", "Cash Transaction": "A cash transaction has two essential features. A transaction that takes place and cash is given immediately. Cash needs to be paid upfront and even the delivery shall take place at the same time. If delivery takes place now and payment is to be settled at a later date agreed by both parties involved in the transaction then it is no longer a cash transaction. The simplest example of a cash transaction can be if you walk into a garment shop, pick out a jacket, pay for it in cash and walk out with the jacket. In the above transaction both elements are then fully satisfied as cash payment and delivery both take place at the same time.", "Certificate of Deposit": "It is a timely deposit. A cost-effective product commonly accessible to the clients in the US by thrifts institutions, credit unions and banks. The trademark for the customary certificate of deposit is safety that is vended by credit unification or a bank. Financiers looking for a low jeopardy investment suppose that once it’s held to development numerous CDs would yield the full quantity of the innovative speculation even if the organization delivering the certificate of deposit breakdowns.", "Claw Back": "Claw back is the specific kind of a clause which is added at the time of signing a contract. This is a typical one and is added frequently in the major employment contracts of firms and companies.", "Co-financing": "Other than financing techniques, there is another term known as co-financing. Basically on official terms, the co-financing is concerned with designing of certain arrangements according to which more than one parties collaborate and contribute towards funding. This procedure and agreement is carried on and followed on international levels.", "Collateral": "Collateral refers to assets or properties which are presented to secure a loan or other credit.", "Collateralized Mortgage Obligation": "Collateralized mortgage obligation is basically a kind of security that has mortgage backing and establishes separated pools of pass-through rates for multiple bondholder classes with a variety of maturities known as tranches. Any repayment from the pool of securities is utilized for retiring of bonds in an order that is laid down in the prospectus of the bonds.", "Collection Agency": "A collection agency is the business oriented agency which is concerned with collection of money of debt from the lenders ad companies.", "Commitment Letter": "A commitment letter is the formal letter which is issued by the lending authorities in order to inform the loan applicant about the terms and conditions about getting the loan credit. The status of the commitment letter is made equal by the authorities as being the legal and formal documents.", "Commodity Paper": "Commodity paper is defined as the loan or advance of issued by the borrower to the lender on part of which the raw materials owned by the borrower serve as the collateral body for both the people.", "Commodity Product Spread": "There are several aspects and attributes of the commodity product spread. The involvement of a commodity product spread in the purchase of a given tangible or intangible commodity is result of the purchase or subsequent sale of the products because of the commodity product spread.", "Conversation Costs": "Conversion cost is defined as the sum of all the costs which have been incurred in carrying out the conversion of an article into the intended output.", "Conversion Premium": "The surplus at which an adaptable security may be sold beyond its transfiguration value is known as premium. If the market price of an alterable security rises, its conversion premium declines. A bond valuing $1500, which is convertible into 50 common stock shares of $25 each will sell on aconversion premium of $250 {$1500 – (50 x $25)}.", "Corporate Finance": "Corporate finance can be delineated as a monetary or financial activity dealing with a company and its money. As per Investopedia, this can consist of anything from IPOs to acquisitions. A corporate finance specialist assists a firm in evaluation of operating data and industry indicators in addition to providing advice about management on budget adjustment and decisions regarding general investment. ", "Cost Benefit Analysis (CBA)": "Cost benefit analysis (CBA) refers to a systematic process that is used to calculate and compare costs and benefits of projects, decisions and government policies. Cost benefit analysis is also sometimes known as benefit cost analysis (BCA).", "Cost-effectiveness Analysis (CEA)": "Cost effectiveness analysis (CEA) refers to a systematic process that helps in comparing two or more courses of action by considering their relative costs and outcomes or effects. Cost effectiveness analysis is related to cost benefit analysis but there is a slight difference between them. Unlike cost benefit analysis (CBA), cost effectiveness analysis does not assign any monetary value for measuring the effects.", "Covenant": "Covenant generally refers to a promise in an agreement, or any other formal debt indenture, that certain activities will or will not be conducted. Putting it simple, it is a clause in a contract that asks one party to carry out, or refrain from carrying out, certain things.", "Credit Cooperative": "There is a People’s Bank in China which has initiated the credit cooperative scheme. This is the sanctioned cooperative union which enables the citizens to get credit. This is provided on tenure system.", "Credit Crunch": "Credit crunch is defined as the reduction in the general availability of loans or credit. It may also be defined as the sudden restrictions and tightening of the terms and conditions which are required for obtaining the loans from banks.", "Credit Limit": "Credit limit is defined as the maximum amount credit that can be withdrawn as the debt from any financial institution or a bank. Basically it is decided by the financial institution to set its own credit limits and range to which the credit can be provided to a borrower in a specific time period.", "Credit Line": "The credit line is defined as the credit source which is extended to any business, government, bank, individuals or any other financial institution. There are several forms in credit line can be interpreted and explained. The most common forms of credit line expansion or restriction include the loan demand, protection of overdraft, any other specific purpose, export packing of the credit, and many other attributes.", "Credit Rating Agency": "Credit rating agency is the rating service company which is destined to assign ratings. There are different kinds of rating included in this regard. These can be expressed as follows.", "Cumulative Preferred Stock": "If the past dividends have been omitted for some reasons, they must be paid to the preferred stockholders rather than the common shareholders. This is known as cumulative preferred stock.", "Debenture": "Debenture is an instrument that is only backed up by the credibility of the issuer in the market and not with any physical asset as such. It is a type of debt instrument which is in an indenture just like other bonds. Debentures are introduced in the market by corporations and government to pool in capital.", "Deflation": "Deflation is the opposite of inflation which means a decline in the money supply or credit. Deflation may also be caused by decrease in spending which includes government or private sector spending. Central banks tend to decrease severe deflation in order to keep the price fluctuation to minimum level because deflation creates uncertainty in the country with decreased demand.", "Derivative": "Derivative is a financial instrument or other contract with all three of the following characteristics:", "Discretionary Trust": "Discretionary trust provides a trustee with the power to decide and come to a conclusion with regard to the beneficiary who would receive the funds and the amount of funds that he/she would get. The trust’s settler may look at guiding the trustee using a memorandum that is informal or through a letter comprising wishes. However, any of the settlor’s attempts to put restrictions on the discretion of trustees renders the trust invalid. Given that none of the assets can be clearly identified with any one particular beneficiary, the creditors are not allowed to attach the assets of the trust towards paying a liability or loan.", "Divestment": "Divestment basically refers to the process of selling an asset. This process is also referred as divesture. The process is carried out either for social or financial goals. Divestment is the converse of investment.", "Dutch Auction": "Dutch auction is primarily a kind of auction wherein the price on a particular item is lowered till the time it attracts a bid. The bid that is made first is considered to be the winning bid and transforms into a sale, on the assumption that the bidding price is more than the reserve price. In this sort of an auction, the investors bid for an amount that they are willing to pay for buying, both in terms of price and quantity.", "Escrow": "An escrow is basically a type of arrangement, which is made as per the provisions laid down in a contract between parties that are transacting with each other, wherein an independent 3rd party gets and disburses funds or/and documents on behalf of the parties that are transacting, with disbursement timing by the 3rd party depending on fulfilling of all the conditions listed in the contract by the parties that are transacting with each other.", "Exploration Expenditures": "Exploration expenditure comprises of the expenditure other than the excluded expenditure which is incurred by a taxpayer in exploration for petroleum in the eligible recovery or the exploration area in relation to the petroleum project.", "Factoring": "Factoring can be explained as a financial transaction that involves a business job sells out its accounts receivable (called invoices) to a third party (referred as a factor) at a discount. “Advance” factoring involves the factor to provide finance to the account seller in the form of a cash advance, usually 70-85% of the purchase price of the accounts. The balance of the purchase price, along with the net of the factor’s discount fee, and other charges is paid upon collection.", "Finance": "Finance is generally defined as “funds management” or the management of money. However, modern finance is a family of business activity which involves the marketing, organization, and management of cash. Moreover, money surrogates through the way of instruments, capital accounts, and markets created for transacting and trading assets, liabilities, and risks.", "Financial Management": "Financial management can be referred to as a branch of finance dealing with the managerial significance of the finance techniques. It involves planning, organizing, directing, and controlling the financial activities of a business firm, like procurement and utilization of the funds of the business firm. ", "Franchise": "By definition, a franchise is a form of business organization in which a firm is already successful because of a good product or service called the franchisor, who gets into a contract based relationship with another business called a franchisee, who operates under the name of the franchisor for a fee.", "Franchisee": "A franchise is an agreement in which a party (franchisor) shares business knowledge, trademarks, techniques and other unique selling points with another party (franchisee). The franchisee then may operate under the franchisor’s name and carry on a separate business but within the perimeters set by the franchisor.", "Franchisor": "A franchise is an agreement in which a party (franchisor) shares business knowledge, trademarks, techniques and other unique selling points with another party (franchisee). The franchisee then may operate under the franchisor’s name and carry on a separate business but within the perimeters set by the franchisor.", "Fraud": "Fraud is considered to be the economic evil. It’s actually a tricky or unlawful way to obtain something. Fraud vanishes the trust of the person who had been victimized from it. Fraud got motivation from the will or desire to deceive someone or unlawfully capturing the money or the property from the person who previously trusted the person who had done fraud with him. This evil has wreaked up the faith among the persons and makes the community to be less depended to the term ‘trust’.", "Free Price System": "The term free price system refers to an economic system where prices are decided by exchange of demand and supply and the prices resulting from it is taken as a signal which is communicated between consumers and producers and which helps in guiding production and distribution of the resources. Free price system is also known as free price mechanism and sometimes informally they are called the price mechanism or the price system.", "Garnishment": "Garnishment is a process that is extremely associated with the payroll accounting. In this process, the employer holds the wages of the employee by the order of a court. Then the employer remits this money to the person or agency, which the court specifies explicitly. This process of withholding and remittance by the order of a court is known as wage garnishment.", "GE/McKinsey Matrix": "The GE/McKinsey matrix is a form of analysis using a portfolio, it outlays the strategic units of the business and the position of SBU (it is a combination of product market which needs a separate business plan) in the industry. It locates the industry attractiveness on the vertical axis and the business unit strength on the horizontal axis, both in categories of high, medium and low. It was originally developed by McKinsey for the general electric company. It is indicated on the axes weigh the business options under two criteria the first is the attractiveness of the potential industry and the second is the business strength.", "Golden Parachute": "An agreement between a company and an employee which states that the employee will be entertained with certain benefits if his employment is terminated is known as a golden parachute. Golden parachute is provided mostly to executive employee and benefits are significant and noteworthy. In some cases, this termination of an employee is due to a merger of companies or takeover of a company while in other cases golden parachute may depict packages for executive officers like CEO as a result of separation or termination of partnership and is not related to changes in the ownership.", "Grace Period": "A grace period is the time period during which the late penalty on the obligation due is not charged. In this period of time, the late payments regarding your due obligations are not charged with the default surcharges. In other words, Grace period is an extension period that is provided to you from your borrower out of good will.", "Grey Market": "A grey market or gray market is an unauthorized and unofficial market where products are bought and sold at lower prices than the official price of that product. While grey market is legal, it is an unofficial market where goods are traded through distribution channels which are unauthorized by the manufacturer of that product. Grey market is similar to the term black market. However grey economy, sometimes known as ‘hidden economy’ or underground economy means paying the workers under the table where no income tax is paid or no contribution is made to Medicare, Social Security and such other public services.", "Gross Domestic Product (GDP)": "The actual definition for Gross Domestic Product (GDP) can be given as the financial value of all finished goods and services generated within a nation’s borders in a certain time period, though GDP is generally evaluated on a yearly basis. This counts all of public and private consumption investments, government outlays, and exports less imports occurring within a specific territory.", "Gross National Product (GNP)": "Gross National Product (GNP) can be defined as an economic statistic which includes Gross Domestic Product, plus any income earned by the residents from investments made overseas. Also, the income earned within the domestic economy by overseas residents. As explained by Investopedia, Gross National Product (GNP) refers to a quantification of economic performance of a country.", "Hedge": "A hedge is, generally, an investment position projected to make up for potential losses which might be incurred by a cohort investment. In theoretical terms, a hedge refers to an investment made to reduce the risk of unfavorable price movements in an asset.", "HIBOR": "HIBOR is actually the rate through which the banks in Hong Kong deal with each other in the inter bank market. The lending and borrowing in Hong Kong dollars between their banks is done with the help of a rate that is known as HIBOR.", "Highly Leveraged Transaction (HLT)": "A bank loan given to a company which is already in huge debt is high leveraged transaction. It results in doubling the liabilities of the borrower because the acquisition or recapitalization transaction is made. The high leveraged company means that already huge loans has been taken the interest rate might also be high too.", "Holding Company": "Holding company can be explained as a parent corporation which owns sufficient voting stock in another corporation to control its board of directors (and, thus, controlling its policies and management). As explained by Investopedia, it is essential for a holding company to own a minimum of 80% of voting stock to obtain tax consolidation benefits, like tax-free dividends.", "Horizontal Integration": "When the same level of value chain acquires additional business activities, then it is referred to as horizontal integration. This can be said that horizontal integration refers to control and ownership.", "Hostile Takeover": "A hostile takeover takes place when the company is taken over without the choice of management especially the directors. It is either done with the purchase of shares or with the help of a demand to request the change in the management.", "Human Resource Management": "Human Resource Management is important for every company, as it helps in organizing the recruitment process within a company. Human resource management is not limited just to the recruitment process alone, but also helps in managing the employees and also help in providing the necessary guidance that is required by the people employed with a given organization.", "Human Resources": "Human resources are the collection of individuals who work in an organization and form its workforce. Human resources are also sometimes known as human capital, but the term human capital has a narrow view where individuals working in the organization are seen only from the viewpoint of the knowledge that they have and how that can be useful to the organization. There are also many other terms that are commonly used for human resources and they are ‘manpower’, ‘labor’, ‘people’ or ‘talent’.", "Hyperinflation": "Hyperinflation is actually the process when the prices become out of control and they increase rapidly. Hyperinflation in the economy results in the decrease in the value of money as the demand supply formula loses its original shape.", "Incorporation": "Incorporation is a procedure that declares that a corporate company is separate from its owners. There are many benefits of incorporation both for the owners and business, such as...", "Incoterms": "Incoterms is the term (short for International commerce terms) that is used in the international contracts and published by the International Chamber Of Commerce. This term was developed to bridge the gap between the members of the industry so that they can use a uniform language.", "Inflation Rate": "Inflation is the rise in the price of products for general consumers which in turn affect the cost of living of a normal consumer.", "Initial Public Offering (IPO)": "Initial Public Offering (IPO) is the first stock sold by a private entity to the public. Initial Public Offerings are generally used by younger and small entities that are looking to raise or expand their capital. However, IPOs can also be offered by large private companies that wish to trade publicly.", "Inside Information": "Inside information is the material information regarding an entity, which only the board of directors, management, or/and employees and not the public is aware of.", "International Monetary Fund": "IMF which is the abbreviation of International Monetary Fund is the largest financial and economic organization of the world.", "Job Analysis": "Job Analysis is a process, which is used to collect information relating to the responsibilities, duties, skill sets, conclusion and work environment of any given job. The information needed to analyse the job could require a person collecting endless data. This analysis helps in figuring out the result of a given job. The result can be in the form of performance development, recruitment planning and more.", "Joint Stock Company": "A Joint Stock Company may be defined as a company that issues stock and allows derived promotion trading making the stockholders legally responsible for the debts caused to the company. A Joint Stock Company is a combination of a partnership and a corporation. A joint stock company has right to use the liquidity and fiscal funds of stock markets but also is restricted like a partnership.", "Kickback": "Kickback is considered to be a part of the bribe. Kickback is actually a job which is performed by the person or the organization which is considered to be bribed. In other words, the favor which is done by the passive bribe partner against the money or the granting of the gift. This process is totally unlawful and against the moral values and ethics. Kickbacks and bribery both harms the public especially to the poor class whose prosperity and progress only lies on the merit system. Moreover, the kickbacks and the bribery impact the welfare system and have the impact on the overall economy too.", "Labor Theories of Value": "The labor theories of value (LTV) are different from the accepted theories of value and states that the value of a commodity only has relation with the labor required for obtaining or producing that commodity and is not related to any other factors of production. The concept of labor theories of value is often linked with Marxian economics in present times. It is also related to earlier classical economic theories like the theories of David Ricardo and Adam Smith. The term ‘labor theory of value’ was never used by Karl Marx for describing the theory of value; instead he referred to a law of value which has no association with the concept of’ labor theory of price’ which is a classical economics concep", "Lessee": "A person lending a property after making an agreement in black in white is a lessee. It can be also be defined as the tenant who take a property on rent and performs his part of obligations as mentioned in the agreement. As this is a legal document if the lessee fails to perform the obligations he can be evicted.", "Lessor": "Lessor can be defined as the owner of the property that has been the subject matter of the leased agreement. It can also be known as the person who gives his property to the lessee for a particular duration.", "Letter of Credit": "A letter of credit, generally, refers to a letter supplied by the buyer’s bank to the seller after the accomplishment of a contract between a buyer and a seller. This letter of credit from the bank guarantees that the buyer’s payment will be made to the seller on time and for the right amount. If, in any case, the buyer is unable to make payment at the time of purchase, it is required by the bank to cover the full or pending amount of payment.", "Life Annuity": "It is a sort if a life insurance that a person wishes to take making his/her retirement safe. Life annuity is based on a pre-determined amount that the annuitant wishes to pay periodically till the retirement day. The payments made to him until he ceases to live anymore that is till that person dies.", "Limited Liability Company (LLC)": "According to definition a Limited Liability Company (LLC) is a corporate structure in which the shareholders of the company have limited liability to the company’s actions. A Limited Liability Company provides the shareholders the required personal liability protection for any action of the business. The compensation of the business is not recovered with the assets of the owners.", "Limited Liability Partnership (LLP)": "A Limited Liability Partnership (LLP) is basically a new kind of corporate framework, which combines the flexibility involved in a partnership and the benefits of limited liability of an entity at a compliance price that is very low. Thus, it offers the advantages of limited liability of an entity and also permits its members to organize their internal management based on a mutual agreement, like in the case of a partnership entity.", "Management Discussion and Analysis": "Management Discussion and Analysis is basically business related information that has been mandated by the Securities and Exchange Commission, which must also come with 3 years of financial statements that have been audited. At present, it is considered as a prominent part of filing of registration and must reveal the liquidity related position, operations results, capital resources, prominent causes of material alterations in the finance related statements, events of infrequent or unusual nature, negative and positive trends as well as important uncertainties of the corporation.", "Marginal Utility": "Marginal utility is the concept according to which the customer can be provided with the sense of satisfaction when any gain is received by the consumer while he or she is getting any goods or service by one more unit.", "Market Economy": "Market economy can be defined as the economy in which all the decisions are taken on the basis of demand and supply and free price system. In a market economy, decisions related to production, investment and distribution are dependent on the demand and supply and free price system or free price mechanism is used for determining the prices of goods and services.", "Maturity": "Maturity, basically, refers to the length of time by which the principal amount of a bond should be paid off. In simple words, it can be explained as the end of a security’s life. The Investopedia explains maturity as the date by which the borrower is supposed to pay back the amount borrowed by him through the issue of a bond.", "Microcredit ": "Microcredit is the scheme which is introduced to benefit the small level borrowers. In this scheme there is an extension of small loans which is offered to the small level borrowers.", "Microeconomics": "Microeconomics is that particular branch of economics, which focuses on analyzing how individual firms and consumers are behaving in the market with an intention to understand the procedure of decision making of the households and firms better. Microeconomics takes the interaction taking place between individual sellers and buyers as well as the factors, which influences the selection made by the sellers and buyers into consideration. Thus, in general, microeconomics pays attention to the patterns of demand and supply and determines output and price in different markets.", "Microfinance": "Micro finance also known as micro credit is a type of banking service which serves those who cannot afford the service otherwise. Like the unemployed and those in a low income group. It brings the essential services of finance like insurance, loans and savings in reach of the mentioned class which is not going to be able to gain access to such services otherwise, so this is a socially conscious attempt at making them independent and better off. To improve the standards of living for the masses which will thus, make the whole society better off.", "Mixed Economy": "Mixed economy is referred to the economic system in which both public sector and private sector coexist. In this type of economic system, private sector as well as the state direct the economy and the means of production is shared between them. This economic system exhibits characteristics of both market economy and planned economy. Mixed economy can be best described as the market economy where there is a strong regulatory oversight and which has many government enterprises and government provision of public goods.", "Money Laundering": "Money laundering is considered to be the serious crime. This crime is at the growing rate as most of the individuals are not known to this term. In such case, the Government becomes lone and thus it’s become harder and harder for them to tackle this serious crime like this money laundering. Money laundering refers to the transfer or exchange of the property which is gathered from and illegal source. It’s actually the process where the illegal money or property becomes legal under the rule or law table.", "Money Market": "Money market is basically that particular section of the finance market wherein finance related instruments, with very brief maturities and high amount of liquidity are adequately traded. The money market is utilized by the participants for the purpose of lending and borrowing for a brief period, for a number of days to a little less than a year. The securities of money market incorporates certificates of deposit that are negotiable, U.S. Treasury related bills, bankers acceptance, commercial paper, federal funds, repurchase agreements and municipal notes.", "Monopoly": "Monopoly is a situation wherein a single entity owns either nearly all or all of the market for a particular kind of service or product. This happens in situations where a barrier exists for entrance into the industry, which permits the single entity to operate in the absence of competition. In this type of industrial structure, the products manufacturer will mostly produce a volume which is lesser in comparison to the amount that would enhance social welfare.", "Mortgage": "A mortgage refers to a lien or loan on a property which is supposed to be paid off over a specific time period. It can be considered as your personal guarantee which ensures that you will repay the money borrowed to buy a property.", "Negotiable Instrument": "Negotiable instrument is the document which provides the guarantee of payment of a specific amount of money. This payment is required to be made either on the set time or on demand by the lender.", "Non-Cumulative Preferred Stock": "Noncumulative preferred stock refers to the preferred stock shares which usually have dividends starting all over in every year. In case the company fails to pay dividends in one year, the dividends will not accumulate in arrears. The company is only expected to pay the dividends for the current year before the remaining amount is paid to the common shareholders.", "Off Shoring": "You must have heard of outsourcing, it is when a company hires another to perform certain functions for it. It is an external recruitment. Off shoringis the type of outsourcing where the company outsources its functions to be done in another country. This has a lot of benefits for the company yet some drawbacks too, like everything else it has its own pros and cons.", "Oligopoly": "The oligopoly refers to the market structure where the hold is held in the hands of a few firms. This situation leads to a highly concentrated market. Oligopoly does not merely means that only a few firms operate, but it suggests that operating firms can be many but the domination is held by a few ones.", "Omnibus Account": "“Omnibus” refers to an item which has a number of other items inside it. For example, a book has several different stories of different authors will be called omnibus. Similar is the case of Omnibus account, a combine account of different investors is known as Omnibus account.", "Overdraft": "An overdraft can be defined as the amount by which withdrawals surpasses the deposits, or the extension of credit through a lending institution to consent to such a situation. In simple words, an overdraft allows the individual to continue withdrawals even with zero funds. ", "Participative Management": "Participative management is a decentralized form of management. It is an employee friendly environment where the workers are encouraged by giving advices and actively participate in the role in decision making. It is practiced by the managers or employers who value their employees and believe that a cooperative relations which their employees will have a positive impact on their morale thus productivity, as labor is a huge asset of any business.", "Pension Parachute": "Pension parachute is a kind of defensive approach adopted by corporations to get secured against unreceptive takeover. Basically, Pension Parachute is a pension agreement which states that in the case of hostile take over the raiding firm will not be able to use pension assets to finance the acquisition and the pension plan assets are only available to provide benefit to the participants of the plan.", "Performance Management": "Performance management is the process which focuses on achieving targets and goals in an efficient and effective manner. This process aims at enhancing organizational effectiveness by improving individual performances of employees, department, or processing.", "Perpetual Debenture": "Perpetual debenture is also called the perpetual bond or simply Prep. It is defined as the bond with no maturity date. Therefore it is advised to be treated as the equity and not as the debt. The issuers of this bond pay coupons on the perpetual bonds for ever. In this way these people have to redeem the principal. It is due to the same reason that the phenomenon of cash flows of the perpetual bond is known as perpetuity.", "Personnel Selection": "Personnel selection is the process used for hiring individuals from the pool of job applicants having the required qualifications, knowledge, skills and competence to fill the vacant positions in the organization. The personnel selection process is the tool that management applies to differentiate between applicants who are qualified and who are unqualified by using different techniques. Selection is a negative process of employment because the applicants who qualify are only offered employment and the unqualified applicants are denied the opportunity. The aim of the selection process is to choose the most suitable candidate whose contributions will be most valuable for the organization.", "Petty Corruption": "The term \"petty corruption\" is used for the corruption which are done on the small scale or the corruption which is done on the low-level. The corruption amount seems to be little if we compare it to the overall business transactions. Petty corruption has reeked up the overall business performance and thus the whole corporate world is getting affected because of it. The petty corruption includes inside the use of Grease money, this includes the extortion money (the money which is paid to the police or any other person to avoid the penalties and fines) and the bribes, for example: paying the customs officials to clear the goods or other thing which is considered to be banned in that particular region.", "Pledged Asset": "Pledged asset is defined as the asset which is given to the lender in order to secure the loans. The word pledge means a promise or such a thing which makes you bound to do something. So the term pledged asset is an asset which is given just to prove that the borrower has got the capacity to pay the market. If you are associated with the financial market since the dawn of business, you must be knowing about a document or a particular asset must be deposited in order to get a loan.", "Predatory Lending": "Predatory lending is not at all considered as the legal practice. In terms of capitalism and economics, this procedure is considered as the unfair and deceptive practice on part of lenders and they can then use these unfair means for the unfair loan origination procedures.", "Preemptive Right": "Preemptive rights refer to shareholders who possess the right to maintain some share of ownership of an organization through the buying of the proportional number of shares to the percentage of shares they already have in the corporation. The stockholder has the right to buy some additional shares in the company of new issues for Equity preservation. This is done before anyone else can purchase shares of a new issue for equity preservation.", "Preference Shares (Preferred Shares)": "Preference shares (preferred shares) refer to the stock which proffers a specific dividend being paid prior to the payment of any dividends which are paid to the common shareholders.", "Prepayment": "Prepayment is the phenomenon which marks the repayment of loan before time and in early installments. The borrower normally repays the loan in order to save oneself form the high interest rates and the repayment is observed in cases of the refinancing by the borrower.", "Private Company": "Also known as private corporation, private company,  is a company whose shares are not traded in the open market. The ownership of the company is private which is a reason why it is not required to meet the necessary rules of public companies. The stocks can be issued and the company can have shareholders but these shares are restricted only to the company and company holders and not given out for the public. ", "Private Property": "Private property is the ownership of the property and this ownership is by the non governmental legal bodies. There are clear distinctions between the private and public properties. Usually the public property is owned by the governmental bodies. The private property is even different from the collective property which is owned by a group of individuals.", "Producer Price Index (PPI)": "", "Prospectus": "A prospectus is a legal document that is required by every company and is to be filed with the Securities and Exchange Commission to provide with the details of investments that are being offered to the public for sale. A prospectus should contain all the necessary facts and figures relating to the investments that would be useful for the investor to make the necessary investment related decisions while making purchase of these investments. The prospectus is also called “Offer Document”.", "Protectionism": "Protectionism is a policy adopted by some countries to protect domestic industries from global competitors by imposing some restrictions on trade of goods and services between countries. In this policy government of that particular country increases tariffs (import taxes), Quotas, Embargoes (a complete ban on imported goods), import licensing, subsidies, exchange controls etc to increase prices of imported products which make them expensive and less attractive. Countries using protectionism when they feel that their industries are getting damage from unfair global competition. In short-term, it work like a defensive measure but if it remains for long-term may ruin the industries trying to protect as less competitive on global marketplace.", "Public Company": "Public company, also known as public corporation, is a company whose shares are traded publicly and such a company has plenty of shareholders. The company offers its shares to the company as a public offering and the daily value of the company is evaluated because of daily trading that happens in the company.", "Quasi Loan": "It happens many times when an agreement is signed between two parties and according to this agreement one out of two parties agrees to pay the debts and loans of the other party. In return to this favor provided by the party paying the loan for another, the second party has to agree upon the reimbursement of the amount at some later date but keeping this agreement the first and foremost priority.", "Quasi Rent": "The term quasi rent is not new to the economists. This is basically an analytical term which is used for the income earned as a result of the opportunity cost after investment. Usually it so happens that the individuals face the loss of cost investment and their payment may be sunk. The amount earned after such a loss is called as the quasi rent. The term of quasi rent is not too old and it was used for the first time by Alfred Marshall. He was the first economist to earn quasi rents.", "Quasi-Reorganization": "Company records are changed to remove the deficit of the retained earnings and restating the balance sheet by showing bankruptcy. Although bankruptcy is not filed, shareholders have to agree to the changes. These are controversial policies because they do not change the financial position of the company, instead it just plainly makes the balance sheet looks prettier and healthier. This accounting policy is seldom done. This is just a tool in the accounting industry to restructure corporate", "Real Estate Investment Trust (REIT)": "It is a form of security that sells like stocks through major exchanges and directly invested in real estate, either through the help of mortgages or through the properties. They get tax-relief and other tax considerations that offer investors high yields including liquid methods and ways of buying out properties and real estate.", "Real Estate Mortgage Investment Conduit (REMIC)": "REMIC is a special purpose vehicle or an SPV for issuance of mortgage-backed securities (MBS) or to pool in mortgage loans. Real estate mortgage investment conduits (REMIC) are responsible in holding residential and commercial mortgages in trust and issuing new interest for these mortgages to investors. It is a pass through tax thing that holds the real estate property. This financing vehicle was created through tax reform act of 1986. They are mortgage backed security.", "Recapitalization": "Recapitalization is a term used to denote some sort of legal reorientation of the company’s capital structure. There may be a variety of reasons because of which the recapitalization takes place. Mainly it is denoted as a procedure by which a large part of the equity is converted into debt and also a large part of the debt is converted into equity.", "Recession": "The word recession is mainly associated with a big decline in the economic activity of a country in terms of industrialization, employment and other such activities. It is such a condition where people have no employment or the employment is very scarce. It is also indicated by a steep decrease in the growth of economy as measured in the terms of Gross Domestic Product (GDP). It is also defined as a slowdown of the business cycle throughout the country. If we look from the macroeconomic view, then the indicators like GDP, employment of people, capacity utilization, spending on investment, household incomes, and profits in business and inflation sharply declines.", "Regulated Investment Company (RIC)": "In matters of the business agreements and the other issues, it is necessary that you count on the companies that are eligible to permit the interests or dividends, taxes that depend on the capital gains that are earned due to the investment of the funds. It is passed to the shareholders on a highly personal basis so that one can avoid the aspects of the double taxation to a certain extent.", "Reinsurance": "In matters of the economy, the first thing that strikes the mind of the people is the security and the risk management. It is important to give proper priority to the financial aspects that include the uncertainty on the ground of the accidents, legal liabilities, failures of the projects, natural disasters and other calamities. To ensure a healthy background and security of the public, it is necessary to choose the right kind of the management procedure. It is not that the risks will come into the investment field with proper notification. It becomes the duty of investors to make sure of their security to a certain level. Reinsurance is that part of the investment that is completed by the insurance company, to handle the risk managing factor.", "Related Party Transaction": "Related Party Transaction is one of the most common genres today in the field of business and finance. The present economic background deserves special attention for it is in a pretty vulnerable condition. People are giving the Related Party Transaction a thought just because it has the facilities of both the commercial and the personal transactions. Apart from the commercial transactions it is possible that one can carry on the transactions on the basis of consideration. To conduct the long distance transactions, this system has come up with some well-organized terms and conditions so that it becomes beneficial for the management to get the transactions done.", "Risk Management": "Risk management is the process in which there is involves analysis, identification and either adoption or palliation of uncertainty is involved in decision-making of investment. And essentially, risk management happens any time a capitalist or fund manager examines and efforts to quantify the possibility for deprivation in an investment then carries the precise action or inaction which given their investment targets and risk margin.", "Sale–Leaseback Transactions (Leaseback)": "In a sale-leaseback arrangement, an owner sells his or her belongings or property and instantly leases it back to the buyer as part of the same transaction.", "Self-financing": "Self financing is the procedure in which the company or an individual spends his own money for the completion of ongoing projects in case of unavailability of funding sources.", "Single-Premium Deferred Annuity (SPDA)": "Single Premium Deferred Annuity (SPDA) is a type of annuity contract that is recognized with a solitary lump-sum payment by the owner.", "Sole Proprietorship": "Sole Proprietorship by definition is an unincorporated business which has only one owner and is one of the simplest businesses to set up and is a very popular choice of most of the business men today. A Sole Proprietor is the owner of the company and does not have to pay taxes of the business separately but has to provide with the details of his business profits and losses as an individual income tax return. Most businessmen prefer sole proprietorship as they would not have to think of names to run as a company but can be named after the sole proprietor himself.", "Spot Market": "The spot market is a commodity or security market where goods, both perishable and non-perishable are sold for money and delivered immediately or within a short span of time. Contracts traded on a spot market are also in effect instantly.", "Standard Industrial Classification": "A standard 4-digit code used by the US government to identify the industries according to their functions or products is Standard Industrial Classification (SIC). These codes were later replaced in 1997 with 6-digit codes mostly. However the Securities and Exchange Commission still uses the SIC codes.", "Start-up Costs": "Start-up costs are basically non-recurring costs,which are associated, with setting up a business such as fees of an accountant, registration charges, legal fees, promotional and advertising activities, as well as employee training. It is also called as start-up, preliminary or pre-opening expenses. In other words, start-up cost means a variety of different costs,which a new business owner should incur so that the business gets established. These are typically one-time costs, and they are often allowed to be amortized. Start-up cost also includes the acquiring equipment, fees, paying for a place for conducting the business, living expensesand so forth.", "Strategic Planning": "No doubt no one can violate the importance of strategic planning in any organization. It's simple as putting some strategic planning to analysis and determines where the company is going over in the next few years or more and how it is going to get that position and how it will know that it's getting the specified goals or not?", "Subordinated Debt": "It is a type of debt that is risky and is secondary in position with respect to repayment of loan, in case of default by the borrower. In other words asubordinated debt that ranks below other securities or loans when the phase of loan repayment occurs.", "Subprime Lending": "There are many names for the term subprime lending. It is also called as the near prime lending, non prime lending andsecond chance lending. In principle the sub prime lending refers to making loans to the people who are having any difficulty in maintaining the schedule of repayment of the loan. This is sometimes very disturbing on part of the borrowers when they do not find any way of paying off their loans.", "Surplus Value": "The surplus value, according to Karl Marx is the new value that the workers create in addition to their own labor cost and that which is available for appropriation by the capitalist. It allows for making profit and is the foundation for capital accumulation. This concept of surplus theory was developed and written by Karl Marx, but the term is not invented by him.", "Swap": "Customarily, swap is delineated as the exchange of one security for another to alter the quality of issues (stocks or bonds), maturity (bonds), or because of change in investment objectives. In recent times, swaps have grown to take account of currency swaps and interest rate swaps.", "Task Analysis": "Task Analysis is the recognition of the prime elements of any given job and then understanding the skills required to make sure that the job is done with perfect outcome. This information is essential for the human resource management department, as it will allow them to plan objectives and help in organizing training programs and necessary tools that are required to make sure that the required job is done.", "Taylorism": "Taylorism which is also known as scientific management was a theory of management that describes and integrates actions. The main goal of Taylorism is to provide the way of bettering the economy, especially in the field labor production. It was involved several steps of involving, resource allocation and development. It becomes Taylorism due to the name of Frederick W. Taylor in way back 20th century.", "Technical Analysis": "Technical analysis refers to a method used to gauge securities by analyzing statistics produced by market activity, like past prices and volume. Technical analysts do not endeavor to estimate the intrinsic value of a security. They rather use charts and similar tools to recognize patterns which can suggest future prospects.", "Theory of Value": "Theory of value is a term used in economics which covers all the theories included in economics that explain price of goods and services or exchange value. The basic and most important questions of the theories of economics are why the price of goods and services are priced as they are, how the price of goods and services are considered and how the correct price of goods and services can be calculated.", "Time Management": "Time management refers to the process or act to plan and exercise control over the amount of time that is used for performing specific activities. The main purpose of time management is to increase productivity, efficiency and effectiveness. For time management a variety of techniques, skills and tools may be used for managing time when specific goals, projects and tasks are needed to be accomplished within a given due date.", "Trademark": "Trademark is a registered symbol that represents that the specific product is the intellectual property of the manufacturer or the distributor of the product and only these specified personnel have a right to manufacture and distribute the product and realize profits on it.", "Transfer Pricing": "Transfer pricing is when the business divisions are treated as separate entities so that the price charged by one part of the company from another part of the same company in order to provide them with certain service is known as transfer pricing.", "Trustee": "Trustee is the legal term and it has been used in its broadest form. This term refers to the person holding any property or any position or any authority and he or she runs the matters of that possession for the benefit of another person or persons. In other terms he is holding the trusteeship of the property or possession.", "Underwriting": "Underwriting can be explained as a process through which the investment bankers raise investment capital from investors on the behalf of governments and corporations which are issuing securities (debt as well as equity). However, underwriting is also referred as the process of issuing insurance polices.", "Unique Selling Proposition (Unique Selling Point)": "Let’s start with the basic question, what is a unique selling proposition? It is the factor or aspect of a product the producer highlights or claims to be special to make it stand out in the market. This concept of USP is crucial to any strong marketing plan. It represents what is your business all about and how does your product serve the target audience better than the other competitors do. In today’s globalised market it is very important for a firm to create a successful USP in order to gain competitive advantage over the many close substitutes available.", "Unsecured Bond": "", "Venture Capital": "Venture Capital is the financial capital which is provided by investors to high potential and high risk start-up firms and small companies with long term growth potential.", "Vertical Integration": "This is not new that a certain company tends to expand its production line into different areas especially when the manufacturer has some liabilities. Here comes the point when vertical integration plays role as its provide companies an edge in cutting down the extra costs and show efficiency by cutting down the expenses spend on transportation and reducing the duration of the work as well. Despite of the advantages of vertical integration, many times companies follow economies of scale and knowledge of the suppliers.", "Voucher": "Voucher is a piece of evidence, which proves that a certain event or transaction is carried out. Voucher can be in three different forms. ", "Warrant": "A warrant refers to a derivative security which provides the holder with the right to purchase securities (generally equity) from the issuer at a particular price within a specific period of time. Warrants are generally included in a fresh debt issue as a “sweetener” to inveigle investors. They can also be used for enhancement of the bond yield thus making them more attractive to prospective buyers.", "Work Breakdown Structure (WBS)": "Work Breakdown Structure (WBS) may be defined as the form of work to be performed by people in an order or chain of command. It is a structure that helps define the tasks to be performed at different stages by the elements involved in a hierarchy to achieve the end result. The form of work could be anything like a product, data or a service. ", "Yield": "A yield refers to the income return on an investment. This indicates the dividends or interest received from a security and is generally expressed yearly as a percentage based on the cost of investment, as well as the face value or the current market value.", "Audit Engagement": "Audit engagement refers to audit performed by an auditor. It is the very first stage of an audit procedure where the client is notified by the auditor that the work pertaining to audit has been accepted by him/her and also provides clarifications with regard to the scope and purpose of audit. To be more specific, audit engagement can be referred to the written letter that the auditor uses to notify the client that he/she would be engaging in auditing services. Thus, the audit engagement procedure is basically a negotiation based on professional terms that takes place between prospective customer and a public accounting entity. This procedure is used for finding new customers and offer accounting related services to different businesses.", "Audit Evidence": "Audit evidence generally refers to the information collected for reviewing the financial transactions of a company in addition to its internal control practices and other essential factors required for the certification of financial statements. The type and amount of the considered auditing evidence varies significantly on the basis of the type of organization being audited in addition to the required scope of the audit. The audit evidence are important to be collected by an auditor during the process of his auditing work.", "Audit Opinion": "An audit opinion refers to a certification accompanying financial statements and is provided by the independent accountants involved in auditing of a company’s books and records in addition to being helpful in creating the financial statements. The audit opinion is helpful in setting out the scope of the audit, the accountant’s opinion about the procedures and records used for creating statements, and the accountant’s opinion about whether or not the financial statements present an accurate reflection of the organization’s financial condition.", "Audit Plan": "Audit planning is defined as the process in which the strategy is designed to conduct the expected result which also defines the scope of audit inside the company. The size, nature and the time for the audit plan may vary. It depends on the size of the business. If the business is spread to the large scale, the strategy making and its implementation will take more time and also the overall scope of Audit plan may also increase. It’s basically the step by step methodology where the audit in control reviews the financial process and the internal environment along with the engagement preparation.", "Audit Procedures": "The audit procedures can be divided into two categories...", "Audit Report": "Audit report, as recorded in the annual report, examines to check the compliance of a company’s financial statements with GAAP. The audit report is, sometimes, also referred as the clean opinion. An audit report includes three paragraphs – the first stating the responsibilities of the auditor and directors; the second stating the use of GAAP; and finally the third paragraph stating the auditor’s opinion.", "Audit Risk": "Also referred as residual risk, the audit risk can be defined as the risk that the auditor will not discern errors or intentional miscalculations during the process of reviewing the financial statements of a company or an individual. The audit risk generally features two categories – risk regarding evaluation of financial materials and risk regarding the affirmations created by evaluation of financial documents.", "Audit Sampling": "Audit sampling can be defined as the process of applying auditing procedures to under 100% of different items in an organization’s account balance in a way that every single unit might have an equal probability of being selected.", "Audit Trail": "The audit trail is a step by step record that shows what operations had been performed over a specific period of time. It is useful in tracking out any market activity that is improper. It is specially used in trade with the help of which any culprit in any particular trade can easily be identified.", "Auditing Standards Board": "The ASB, short for Auditing Standards Board, exists to serve the public interest by improving the existing audit and attestation services in addition to encouraging new ones. The Auditing Standards Board produces statements, standards, and guidance to certified public accountants (CPAs) for non-public company audits. The pronouncements issued by the Auditing Standards Board in the form of statements, interpretations, and guidelines should be essentially adhered to by all CPAs while performing audits and attestations.", "Baker Tilly": "Baker Tilly is one of the top ten audit firms and is ranked eight best. It is one of the most finest and prestigious accounting companies in the world which is renowned globally. Providing with great financial and advisory services, Baker Tilly has managed to keep up to its reputation by being one of the preferred choice of audit companies in the world. Spread across 120 countries, the Baker Tilly International has over 150 firms.", "BDO": "BDO is among the top ten audit companies in the world and is presently the sixth preferred Audit Company. BDO specialise in global professional financial services and has a wide network of accountancy firms dealing with local and international clients all over the world. BDO is spread over 135 countries and has around 48,000 professionals working for them. Incorporated in the year 1963, BDO is head quartered in Belgium", "Big Four (Big 4)": "The Big Four includes the four largest international professional services networks in accountancy and professional services. These professional services networks handle the wide majority of audits for publicly traded companies and various private companies thus creating an oligopoly in large companies’ auditing. This ‘Big Four’ group was once known as the ‘Big Eight’, and got reduced to the ‘Big Five’ through a series of mergers. The ‘Big Five’ further turned to ‘Big Four’ through further mergers.", "Comfort Letter": "In the auditing context, a comfort letter is a letter or a document from an independent auditor which is included in the preliminary prospectus and which states that though a complete audit has not been done, a review has been done by the auditor which is sufficient for assuring that the information in the financial statement in the preliminary prospectus is prepared properly to the best of his knowledge. The auditor also states that the final audit of the financial statement will not be substantially different from the review that the auditor has done and showed in the preliminary prospectus.", "Compliance Audit": "Compliance audit is essentially about comprehensively reviewing whether a company is adhering to the regulatory related guidelines or not. IT, security and independent accounting consultants conduct an evaluation of the thoroughness and strength of preparations pertaining to compliance. Auditors conduct a review of the security related policies, procedures pertaining to risk management and user access controls throughout the compliance audit course.", "Computer Assisted Audit Techniques (CAATs)": "Computer Assisted Audit Techniques (CAATs) is the tool which is used by the auditors. This tool facilitates them to make search from the irregularities from the given data. With the help of this tool, the internal accounting department of any firm will be able to provide more analytical results. These tools are used throughout every business environment and also in the industry sectors too. With the help of Computer Assisted Audit Techniques, more forensic accounting with more analysis can be done. It’s really a helpful tool that helps the firm auditor to work in an efficient and productive manner.", "Computer Auditing": "Computer auditing is the tool that facilitates the business in regard to data processing while putting a special concern to some targeted operations. The tool merges or reviews the data by the programmers or the accountants and the analysts and extract the data in the summarize form. These computer auditing tools save the time, money and the frustration. These auditing tools also serve for the purpose of monitoring any individual activity, the tool automatically picks the data from the linked PC that is being used by another employee who are usually the accountants and the analysts.", "Conflicts of Interest": "A conflict of interest is believed to occur when an organization or an individual is caught up in multiple interests, one of which could probably distort the motivation for one act in the other. Moreover, a conflict of interest can exist only if an individual or testimony is delegated with some impartiality; a small amount of trust is required to create it.", "Deloitte": "Deloitte Touche Tohmatsu Limited, usually referred to as Deloitte, is one of the Big 4 accountancy firms (other firms are PricewaterhouseCoopers, Ernst & Young, and KPMG). Deloitte is considered as the second largest professional services firm in the world, featuring 1,82,000 employees in more than 150 countries proffering tax, audit, enterprise risk, consulting, and financial advisory services. The company holds its headquarters in Paramount Plaza, New York City, New York, and Midtown Manhattan.", "Detection Risk": "Detection risk is actually the risk that the procedures applied by the auditors will fail to detect material misstatements in the financial statements.", "Disclaimer of Opinion": "Disclaimer of opinion is basically a statement provided by the auditor that doesn’t lay down any sort of opinion with regard to the financial position and condition of the company. Disclaimer of opinion is provided by certified public accountant wherein he clarifies that an audit related opinion/statement cannot be provided owing to limitations of the examinations conducted.", "Ernst & Young": "The Ernst & Young is one of the largest professional services firms around the world as one of the Bid-4 firms in conjunction with Deloitte, KPMG, and PricewaterhouseCoopers. Ernst & Young is an international organization of member firms in about 140 countries, with headquarters in London, UK. Besides, the firm was ranked as the 9th largest private company in US by Forbes magazine.", "Financial Audit": "Financial auditing refers to an accounting process applied in business. The process involves using an individual body for evaluating the financial transactions and statements of a business. The ultimate purpose of financial audit is presenting an accurate amount of the business transactions of a company. Besides, it ensures that the accounts presented to the public and shareholders are accurate and justified. The results of financial audit are useful for banks, shareholders, and anybody else with an interest in the company.", "Generally Accepted Auditing Standards (GAAS)": "Short for Generally Accepted Auditing Standards, GAAS refers to a set of systematic guidelines used by auditors while performing audits on companies’ financial statements, thus ensuring the consistency, accuracy, and verifiability of the actions and reports produced by an auditor.", "Grant Thornton": "Grant Thornton is a globally well known auditing company which has been rated the fifth best auditing firm in the year 2011. Grant Thornton has managed to retain its fifth position in the top 10 auditing companies. Grant Thornton is head quartered in London, UK. This company has known to provide the best audit, tax and consultative know-how and promotes the importance of connecting with the clients they work for.", "Inherent Risk": "Inherent risk is the risk of a material misstatement in the financial statements arising due to error or omission as a result of factors other than the failure of controls. Every company cannot apply the procedure that gives the accurate result to them, the result is basically inherited by the risk factors as the procedure is applied to just a small sample of the population rather than on the whole population. This can lead to the misstatement which is said to be the inherent risk.", "Institute of Internal Auditors (IIA)": "The Institute of Internal Auditors (IIA) implies a guidance-setting organization. Providing service to members in 165 countries, the Institute of Internal Auditors is the internal audit’s global voice, chief advocate, principal educator, and recognized authority, with global headquarters featured in Altamonte Springs, Fla., US.", "Internal Audit": "Internal audit can be defined as the evaluation, monitoring, and analysis of activities associated with the operations of a company, also counting the business structure, information systems, and employee behavior. An internal audit is designed in a way to review the activities performed by a company to recognize the probable threats to the company’s health and profitability, in addition to making suggestions for reducing risk related with those threats so as to mitigate the costs.", "International Standards for the Professional Practice of Internal Auditing": "Internal auditing is the process carried out in different legal and cultural environments; within the organizations that differ in purpose, size, structure, and complexity; as well as by individuals inside or outside the organization. Although differences might affect the practice of internal auditing in every environment, conformance with the IIA’s International Standards for the Professional Practice of Internal Auditing is important in congregating the responsibilities of internal auditors as well as internal audit activity.", "International Standards of Auditing (ISA)": "International Standards on Auditing (ISA) refer to professional standards dealing with the responsibilities of the independent auditor while conducting the financial audit of financial info. These standards are issued by International Federation of Accountants (IFAC) through the International Auditing and Assurance Standards Board (IAASB). The ISAs include requirements and objectives along with application and other explanatory material. The auditor is obligatory to have knowledge about the whole text of an ISA, counting its application and other explanatory material, to be aware of the objectives and to apply the requirements aptly.", "KPMG": "KPMG is one of the leading professional services firms in the world in addition to being one of the esteemed members of the Big-4 auditors, along with PwC, Deloitte, and Ernst & Young. The headquarters of the firm are located in Amstelveen, Netherlands. Moreover, the firm employs about 1,38,000 people and offers three basic service lines – tax, audit, and advisory. The advisory services of the firm are further categorized into three service groups counting Risk Consulting, Management Consulting, and Transaction & Restructuring.", "Litigation Risk": "Litigation risk is the risk that a legal action might be taken against the company soon. The litigation risk analysis provides the assessment to determine whether there is a chance that a legal action will be taken against the company in the future. This risk analysis also determines the possibility of litigation risk arising for the company from a certain contract or a transaction.", "Materiality": "Materiality concept in auditing and in accounting refers to the truthfulness of the material i.e. everything should be exact without the material misstatement or the misstatement in the financial transactions too. The concept in GAAP has no strong or hard rules to make every transaction or the recording with materiality, the truthfulness or the clearness.", "Model Audit": "A model audit refers to the colloquial term used for the tasks performed while conducting due diligence on a financial model, with the purpose of eliminating spreadsheet error. Generally, model audits are appealed by banking organizations, with the purpose of reassuring lenders and investors alike that the calculations and assumptions contained in the model are accurate, and that the results obtained by the model are dependable. When an all-inclusive review of the model is needed, the scope of review is often extended to include tax and accounting, sensitivity testing, and the verification of data contained inside the model back to the legal documentation and original financing.", "Modified Opinion": "An auditor gives an unmodified opinion if the financial statements present true and fair view. In all other circumstances, the auditor gives a modified opinion. The auditor uses different techniques and methods and also applies different procedures to see if the financial statements are free of material misstatements. If all the information in the financial statement is materially correct, the opinion of the auditors will be un-modified opinion. In its contrary, if there are the chances that the information in the financial statement are having some material errors, the auditors gives a modified opinion.", "Non-Sampling Risk": "Non-sampling risk is the risk that despite having selected an appropriate sample, the auditors will arrive at wrong conclusion. If the auditor has chosen right sample and still makes the faulty conclusion due to other reasons, it is known to be a Non sampling risk. Auditors here have mistakenly used the inappropriate procedure for judging the entire sample which leads him to make the non-sampling risk.", "PKF": "PKF is one of the top ten audit firms in the world, ranked 10th. PKF is globally spread over 125 countries and has one of the widest accounting network providing with the best in financial services all over the world. Found in 1969 PKF is one of a kind international merger of accounting firms from Australia, Canada, UK and USA to for PKF.", "PricewaterhouseCoopers (PwC)": "Officially known as PricewaterhouseCoopers, PwC is an international global services firm with headquarters in London, United Kingdom. Besides being one of the members of the ‘Big-4’ accountancy firms, PwC is also the world’s largest professional services firm by revenue. Also, PwC has its offices in about 757 cities across 154 countries and 175,000 employees. The firm came into existence in 1998 through a merger between Coopers & Lybrand and Price Waterhouse. The trading name was thus shortened to PwC in September 2010 as a part of key rebranding exercises.", "Professional Judgment": "Professional judgment is a skill of that an auditor gains through experienced and training. Their judgment is said to be professional if they are well versed to the condition which they are facing. Suppose there is a condition where the accountants have prepared the financial statement, and auditors are there to check if the information in the financial statement is true and not flawed by the misstatement. The auditor who had got the experience and the training for analyzing the validity of the financial statement will make the judgment of that statement, and thus the judgment will said to be the professional judgment.", "Professional Skepticism": "Professional skepticism is the state of mind which is ready for the situation that grabs out the errors or questions the financial events and other events while conducting an assurance engagement. It’s basically a skill just like the professional judgment which makes the auditor alert for any particular situation. They are alert for any sort of reactions which may occur in the financial events of the company. They are relevant questions to make sure the reports or the information is true.", "Qualified Opinion": "An unqualified audit opinion is given when the financial statements present a true and fair view and comply with the legislation. In all other circumstances, a qualified opinion is given. A qualified opinion suggests that the information provided was limited in scope and/or does not comply with the accounting standards or legislation.", "Ratio Estimation": "Ratio estimation uses the known population totals for variables to improve the weighting from sample values to population estimates. It compares the sample estimate of the variable with the population total. The ratio of the sample estimate to its population total is used to adjust the sample estimate for the variable of interest.", "Risk of Material Misstatement": "The risk of material misstatement refers to the risk that the financial statements are materially misstated and do not present true and fair view. The risk of material misstatement is assessed at two levels (i) financial statements level and (ii) assertions level.", "RSM Tenon Group": "RSM Tenon group is one of the top ten audit companies. Founded in 2000 and headquartered in London, RSM is a professional financial company that provides with all types of financial services to its clients including risk management, financial management, tax and advisory. RSM Tenon Group is spread over 80 countries and is globally well known for its various financial services and achievements.", "Sampling Error": "Sampling error, generally, refers to a statistical error to which an analyst exposes a model only because he/she is working with sample data instead of population or census data. However, using sampling data involves the risk that results found in an analysis might not represent the results that would be acquired by using data involving the whole population from which the sample was derived.", "Sampling Risk": "Sampling risk is actually occurs when the auditor applies the procedures to the sample to judge the entire population. Sampling risk is the risk that the auditors opinion would have been different if the procedures were applied to the entire population of the data.", "Sarbanes-Oxley Act": "Commonly known as the “Public Company Accounting Reform and Investor Protection Act” and “Corporate and Auditing Accountability and Responsibility Act”, the Sarbanes-Oxley Act was implemented on July 30, 2002. This act is generally addressed as Sarbox or SOX. It is a US Federal law which set new or improved standards for all US public company boards, management and public accounting firms. The act is named after sponsors US Senator Paul Sarbanes (D-MD) and US Representative Michael G. Oxley (R-OH).", "Smith and Williamson": "Founded in Glasgow in the year 1881, Smith and Williamson has catered to various financial business needs of the customers providing with great advisory and chartered accountant services to its clients. Being one of the top ten audit companies in the world, Smith and Williamson has managed to hold its reputation in the financial world. Spread in over 100 countries and having a great reputation for providing great financial services, Smith and Williamson provides its client with varied financial services.", "Statutory Audit": "The term statutory audit refers to the review or the record of the company of the government organization which is required by the law or the municipal authority of any particular region. This is done to monitor the performance of the firm or the government organization. The company here the auditors who provide the auditing report and submit those reports annually or semiannually to the law or the concerned municipal law authority. This statutory auditing finally does the cross checking of the financial reports which are provided by the companies. They do cross checking by gathering the transaction information from the company’s bank and also from other various sources.", "Statutory Auditor": "Statutory auditors, in most of the countries are referred to the external auditors or the external public accountants who are certified. A statutory auditor is an external or outside service supplier who has the responsibility to certify the financial statements in accordance to specific professional auditing standards like the ACA, ACCA, INSTOSAI standards.", "Unqualified Opinion": "The judgment of an independent author that the financial records and statements of a company are presented appropriately and fairly and in accordance with the Generally Accepted Accounting Principles (GAAP) is called unqualified opinion. ", "Vouching": "The term vouching is the core thing of auditing which refers to the inspecting of documentary evidence by an auditor to support and substantiate a transaction. The main objective of this practice is to establish the authenticity and accuracy of the transactions that are written in the primary books of account. Vouching involves verification of a transaction which is recorded in the books of account by checking it with the appropriate authority and documentary evidence based on which they have made the entry. It also involves confirming and checking whether the amount that has been stated in the voucher is posted to a right account that would reveal the transaction’s nature when it is included in final statements of accounts. Valuation is not included in vouching.", "Appraisal Institute": "The Appraisal Institute is a global association whose members are professional real estate appraisers. The Appraisal Institute has about 23,000 members all over the world. Its members are present in nearly 60 countries. This global membership association of real estate appraisers was established in 1932. It works towards making the appraisal system more transparent and supports equal opportunity and fairness in the profession of appraisal. It also performs its activities according to the federal, state and local laws.", "Appraisal Standard Board": "The Appraisal Standard Board (ASB) is one of the divisions of The Appraisal Foundation which is commonly known as TAF. The Appraisal Foundation makes use of the Appraisal Standard Board to carry out some of its work. The main task that the Appraisal Standard Board performs is developing, interpreting and amending the Uniform Standards of Professional Appraisal Practice (USPAP) and this is done on behalf of the users and appraisers of the appraisal services.", "Appraiser": "An appraiser is a person who appraises something. An appraiser is a professional who is certified to estimate the worth or value of some item or thing. An appraiser is needed to appraise assets and properties to set value to them. They are also needed to estimate the value of assets of businesses. Appraisers are individuals and they work independently to estimate the worth of assets and properties including business assets. They are needed for the preparation of the valuation of a business by making use of the physical review, financial analysis and comparing the business with other similar businesses in the industry.", "Approaches to Value": "Approaches to value are the methods or procedures by which valuation of a property is ascertained. For different property, different approach to value is used. There are three types of approaches to value and they are sales comparison approach, cost approach and income capitalization approach.", "Cost Approach to Value": "Cost approach to value is one of the approaches to value and is used for determining the value of a property. Other than this, there are also two other approaches to value and they are the income capitalization approach and sales comparison approach.", "Income Approach to Value (Income Capitalization Approach)": "The income approach to value, also known as income capitalization approach is used to determine the value of an income generating property by deriving a value indication by conversion of expected benefits like cash flows and reversion into value of property.", "International Valuation Standards Council (IVSC)": "The International Valuation Standards Council is the recognized international setter of standard of valuation. The main task of the International Valuation Standards Council (IVSC) is to develop and maintain standards that deal with undertaking and reporting valuations. It is more important in the cases where the investors and third party stakeholders rely on them. Another task of the International Valuation Standards Council is to support the need for developing a guidance framework regarding the best practice of valuations of the different classes and types of assets and liabilities. The IVSC also looks after the steady and unfailing delivery of the standards throughout the world with the help of extremely trained professionals. Since 1985, the International Valuation Standards (IVS) has been published by the International Valuation Standards Council (IVSC).", "Investment Value": "When a business is sold to an investor as a whole then the investment value is value of the business on the basis of ROI that is return on investment. Investment value is also sometimes known as “going concern” valuation. By “going concern” valuation, we mean the value of a business which is not expected to close and will function continuously. Such a business will be ongoing and will be open for business.", "Project Appraisal": "Project appraisal is the structured process of assessing the viability of a project or proposal. It involves calculating the feasibility of the project before committing resources to it. It is a tool that company’s use for choosing the best project that would help them to attain their goal. Project appraisal often involves making comparison between various options and this done by making use of any decision technique or economic appraisal technique.", "Qualified Valuer": "The profession of a valuer is related with the evaluation and estimation of the real estate. Basically the valuer is concerned with the insurable value of any possession of property. Therefore valuation has become a special case in which the effective and insurable value of a property is estimated.", "Real Estate Appraisal": "Real estate appraisal is the process of appraising and evaluating real property. Real estate appraisal is also known as land valuation and property valuation. In this type of appraisal, the market value of the property is usually required.", "Residual Income Valuation (RIV)": "Residual income valuation (RIV) which is also known as residual income method or residual income model (RIM) is an approach to or method of equity valuation which properly accounts for the cost of equity capital. The word ‘residual’ refers to any opportunity costs in excess which is measured as compared to the book value of the shareholders’ equity and the income that a firm generates after accounting for the true cost of capital is then the residual income. This approach is largely similar to the MVA/EVA based approach having similar advantages and logic.", "Royal Institution of Chartered Surveyors (RICS)": "The Royal Institution of Chartered Surveyors (RICS) is a professional, representative and independent body that works to control surveyors and property professionals in U.K and in other sovereign nations. This representative body provides strict codes of practice for the protection of consumers; it offers training and education standards and give advice to businesses and government. It offers knowledge in matters that relates to fixed assets and this is not limited to real property. It is a member of the International Federation of Surveyors.", "Sales Comparison Approach to Value": "The sales comparison approach determines the value of a property by comparing it to similar properties in the vicinity that have been recently sold, along with proper adjustments for acreage, size, amenities, time, etc. This approach to value is mainly based on the principle of substitution.", "The Appraisal Foundation": "The formation of the Appraisal foundation in 1987 was due to the flux arising in businesses relating to mortgage lending and real estate. A committee comprising of nine professionals in the field, were made, which was impromptu. The main purpose why The Appraisal Foundation was established was to set certain rules that are to be followed by remaining organizations all over Northern America.", "Uniform Standards of Professional Appraisal Practice (USPAP)": "Uniform Standards of Professional Appraisal Practice (USPAP) is a kind of quality control standards in the U.S. and its territories which is related to personal property, intangibles, real property and business valuation appraisal analysis and report. Uniform Standards of Professional Appraisal Practice which is commonly known as USPAP was developed by a joint committee that represents the major United States and the Canadian appraisal professional organizations. It was written in the 1980s.", "Valuation": "Valuation, in finance means the process by which the value of something is estimated. In case of businesses, the value of financial assets and liabilities are usually estimated. Valuation of both tangible and intangible assets is done. Tangible assets include land, building, investments in marketable securities and many more. Some of the examples of intangible assets are goodwill, trademark and patent. Liabilities such as bonds issued by company are also valued.", "Valuation Using Multiples": "Valuation using multiples often known as relative valuation is a technique that is used for making an estimate of the value of an asset and this is done by making a comparison of the asset’s value with the values of similar assets or comparables after analyzing the market.", "Value-in-use": "Value-in-use of an asset is the net present value of cash flows or some other benefits which is generated by an asset in a certain use for a certain owner. This term is used in the U.S. and is usually estimated at use and this value is less than the highest and best use and so this value is usually lesser than the market value. The value in use of an asset may be higher than market value, when a person gets special benefits like grandfathered zoning, agglomeration benefits, or extraordinary financing and at that time the value is regarded as an investment value."}